MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_rtc.c
  * @brief   RTC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Real-Time Clock (RTC) peripheral:
  *           * RTC configuration.
  *           * Calendar (Time and Date) configuration.
  *           * Alarms (alarm A and alarm B) configuration.
  *           * Wake-up timer configuration.
  *           * Timestamp configuration.
  *           * RTC output pin configuration.
  *           * Interrupts and flags management.
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *********************************************************************************************************************/

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

/** @addtogroup RTC
  * @{
  */

/** @defgroup RTC_Introduction RTC introduction
  * @{

  - The real-time clock (RTC) peripheral provides accurate timekeeping and calendar functionality.
    It operates independently of the main microcontroller, ensuring continuous time tracking even
    during low-power modes or system resets.
    The RTC peripheral supports a wide range of features, including programmable alarms, periodic
    wake-up events, and timestamping capabilities.

  * @}
  */

/** @defgroup RTC_How_To_Use RTC how to use
  * @{

  * The Real-Time Clock (RTC) is an independent BCD/Binary timer/counter.
  *
  * The RTC provides:
  *   - Time-of-day clock/calendar
  *   - Programmable alarms
  *   - Timestamp feature
  *   - Automatic wake-up timer
  *
  * The RTC clock, named RTCCLK, can come from different sources:
  *   - HSE
  *   - LSE
  *   - LSI
  *
  * By default, the RTC prescalers are configured to work with the LSE clock at 32.768 kHz.
  *
  * # RTC and microcontroller low power modes
  *
  * The MCU can be woken up from low power mode by RTC functions.
  *
  * The RTC functions are:
  *   - Alarm A event.
  *   - Alarm B event.
  *   - Timestamp event.
  *   - Wake-up timer event.
  *
  */

/**
  * @}
  */

/** @defgroup RTC_Configuration_Table RTC configuration table
  * @{

# Configuration inside the RTC driver

This configuration table is under development.

Configuration defines             | Description      | Default value   | Note                                         |
----------------------------------| ---------------- | --------------- | ---------------------------------------------|
PRODUCT                           | from IDE         |        NA       | The selected device (e.g. STM32ynxx)         |
USE_HAL_RTC_MODULE                | from hal_conf.h  |        1        | Allows use of the HAL RTC module             |
USE_ASSERT_DBG_PARAM              | from IDE         |      None       | Allows use of the assert check parameters    |
USE_HAL_CHECK_PARAM               | from hal_conf.h  |        0        | Allows use of the run-time check parameters  |
  */

/**
  * @}
  */

#if defined(USE_HAL_RTC_MODULE) && (USE_HAL_RTC_MODULE == 1)

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/

/** @defgroup RTC_Private_Constants RTC private constants
  * @{
  */
#define RTC_MICROSECONDS                        1000000U /*!< Number of microseconds in one second */
#define RTC_MILLISECONDS                        1000U    /*!< Number of milliseconds in one second */
#define RTC_MILLIMICROSECONDS                   1000U    /*!< Number of microseconds in one millisecond */
#define RTC_HOUR_SECONDS                        3600U    /*!< Number of seconds per hour */
#define RTC_MIN_SECONDS                         60U      /*!< Number of seconds per minute */
#define RTC_MAX_WAKEUP_VALUE_16BITS             0xFFFFU  /*!< Maximum value of the wake-up timer in 16 bits */
#define RTC_MIN_WAKEUP_VALUE_16BITS             0x0001U  /*!< Minimum value of the wake-up timer in 16 bits */
#define RTC_MAX_WAKEUP_VALUE_17BITS             0x1FFFFU /*!< Maximum value of the wake-up timer in 17 bits */
#define RTC_MIN_WAKEUP_VALUE_17BITS             0x10001U /*!< Minimum value of the wake-up timer in 17 bits */
#define RTC_TIMEOUT_VALUE                       512U     /*!< RTC timeout duration in ms */
#define RTC_WAKEUP_TIMER_CLOCK_SECONDS_ADD_1BIT 0x10000U /*!< RTC wake-up timer Clock seconds 1BIT */
/**
  * @}
  */

/* Private macro -----------------------------------------------------------------------------------------------------*/
/** @defgroup RTC_Private_Macros RTC private macros
  * @{
  */

/** @defgroup RTC_Private_Macros_Assert_Config RTC private macros for global enumerations.
  * @{
  */

/**
  * @brief Test RTC mode.
  */
#define IS_RTC_MODE(mode) (((mode) == HAL_RTC_MODE_BCD)       \
                           || ((mode) == HAL_RTC_MODE_BINARY) \
                           || ((mode) == HAL_RTC_MODE_MIX))

/**
  * @brief Test BCD seconds increment value if mode is not HAL_RTC_MODE_BCD.
  */
#define IS_RTC_BCD_UPDATE(increment, mode) (((mode) == HAL_RTC_MODE_BCD)                           \
                                            || ((increment) == HAL_RTC_BCD_UPDATE_8BITS)  \
                                            || ((increment) == HAL_RTC_BCD_UPDATE_9BITS)  \
                                            || ((increment) == HAL_RTC_BCD_UPDATE_10BITS) \
                                            || ((increment) == HAL_RTC_BCD_UPDATE_11BITS) \
                                            || ((increment) == HAL_RTC_BCD_UPDATE_12BITS) \
                                            || ((increment) == HAL_RTC_BCD_UPDATE_13BITS) \
                                            || ((increment) == HAL_RTC_BCD_UPDATE_14BITS) \
                                            || ((increment) == HAL_RTC_BCD_UPDATE_15BITS))

/**
  * Test asynchronous prescaler value.
  */
#define IS_RTC_ASYNCH_PREDIV(prediv) ((prediv) <= 0x7FU)

/**
  * Test synchronous prescaler value if mode is HAL_RTC_MODE_BCD.
  */
#define IS_RTC_SYNCH_PREDIV(prediv, mode) (((mode) != HAL_RTC_MODE_BCD) || ((prediv) <= 0x7FFFU))

/**
  * @}
  */

/** @defgroup RTC_Private_Macros_Assert_Calendar RTC private macros for calendar enumerations.
  * @{
  */

/**
  * @brief Test calendar hour format.
  */
#define IS_RTC_CALENDAR_HOUR_FORMAT(format) (((format) == HAL_RTC_CALENDAR_HOUR_FORMAT_24) \
                                             || ((format) == HAL_RTC_CALENDAR_HOUR_FORMAT_AMPM))

/**
  * @brief Test shadow registers bypass.
  */
#define IS_RTC_CALENDAR_SHADOW_REG(shadow) (((shadow) == HAL_RTC_CALENDAR_SHADOW_REG_KEEP) \
                                            || ((shadow) == HAL_RTC_CALENDAR_SHADOW_REG_BYPASS))
/**
  * @}
  */

