MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
/** @defgroup RTC_Private_Macros_Assert_Date_Time RTC private macros for time and date enumerations.
  * @{
  */

/**
  * @brief Test time format.
  */
#define IS_RTC_TIME_FORMAT(format) (((format) == HAL_RTC_TIME_FORMAT_AM_24H) \
                                    || ((format) == HAL_RTC_TIME_FORMAT_PM))

/**
  * @brief Test date month.
  */
#define IS_RTC_MONTH(month) (((month) == HAL_RTC_MONTH_JANUARY)      \
                             || ((month) == HAL_RTC_MONTH_FEBRUARY)  \
                             || ((month) == HAL_RTC_MONTH_MARCH)     \
                             || ((month) == HAL_RTC_MONTH_APRIL)     \
                             || ((month) == HAL_RTC_MONTH_MAY)       \
                             || ((month) == HAL_RTC_MONTH_JUNE)      \
                             || ((month) == HAL_RTC_MONTH_JULY)      \
                             || ((month) == HAL_RTC_MONTH_AUGUST)    \
                             || ((month) == HAL_RTC_MONTH_SEPTEMBER) \
                             || ((month) == HAL_RTC_MONTH_OCTOBER)   \
                             || ((month) == HAL_RTC_MONTH_NOVEMBER)  \
                             || ((month) == HAL_RTC_MONTH_DECEMBER))

/**
  * @brief Test date week-day.
  */
#define IS_RTC_WEEKDAY(wday) (((wday) == HAL_RTC_WEEKDAY_MONDAY)       \
                              || ((wday) == HAL_RTC_WEEKDAY_TUESDAY)   \
                              || ((wday) == HAL_RTC_WEEKDAY_WEDNESDAY) \
                              || ((wday) == HAL_RTC_WEEKDAY_THURSDAY)  \
                              || ((wday) == HAL_RTC_WEEKDAY_FRIDAY)    \
                              || ((wday) == HAL_RTC_WEEKDAY_SATURDAY)  \
                              || ((wday) == HAL_RTC_WEEKDAY_SUNDAY))

/**
  * @brief Test date year.
  */
#define IS_RTC_YEAR(year) ((year) <= 99U)

/**
  * @brief Test date month-day.
  */
#define IS_RTC_MONTHDAY_NBR(mday) ((mday) <= 31U)

/**
  * @brief Test time hour depending on the time format.
  */
#define IS_RTC_HOUR(hour, format) (((((format) == HAL_RTC_CALENDAR_HOUR_FORMAT_24) ? \
                                     ((hour) <= 24U) : ((hour) <= 12U))))

/**
  * @brief Test time minutes.
  */
#define IS_RTC_MIN(min) ((min) <= 59U)

/**
  * @brief Test time seconds.
  */
#define IS_RTC_SEC(sec) ((sec) <= 59U)

/**
  * @brief Test time hours for wake-up timer.
  */
#define IS_RTC_HOUR_36(hour) ((hour) <= 36U)

/**
  * @brief Test microseconds.
  */
#define IS_RTC_MICROSEC(micro) ((micro) <= 999U)

/**
  * @brief Test milliseconds.
  */
#define IS_RTC_MILLISEC(micro) ((micro) <= 999U)
/**
  * @}
  */

/** @defgroup RTC_Private_Macros_Assert_Output RTC private macros for output enumerations.
  * @{
  */

/**
  * @brief Test alarms or wake-up output.
  */
#define IS_RTC_OUTPUT_ALARM_WAKEUP(type) (((type) == HAL_RTC_OUTPUT_ALARM_WAKEUP_DISABLE)   \
                                          || ((type) == HAL_RTC_OUTPUT_ALARM_WAKEUP_ALARMA) \
                                          || ((type) == HAL_RTC_OUTPUT_ALARM_WAKEUP_ALARMB) \
                                          || ((type) == HAL_RTC_OUTPUT_ALARM_WAKEUP_WAKEUP))

/**
  * @brief Test tampalarm output polarity.
  */
#define IS_RTC_OUTPUT_TAMPALARM_POLARITY(polarity) (((polarity) == LL_RTC_OUTPUTPOLARITY_PIN_HIGH) \
                                                    || ((polarity) == LL_RTC_OUTPUTPOLARITY_PIN_LOW))

/**
  * @brief Test tampalarm output type.
  */
#define IS_RTC_OUTPUT_TAMPALARM_TYPE(type) (((type) == HAL_RTC_OUTPUT_TAMPALARM_TYPE_PUSHPULL) \
                                            || ((type) == HAL_RTC_OUTPUT_TAMPALARM_TYPE_OPENDRAIN))

/**
  * @brief Test tampalarm output pull-up.
  */
#define IS_RTC_OUTPUT_TAMPALARM_PULLUP(pullup) (((pullup) == HAL_RTC_OUTPUT_TAMPALARM_PULLUP_DISABLE) \
                                                || ((pullup) == HAL_RTC_OUTPUT_TAMPALARM_PULLUP_ENABLE))

/**
  * @brief Test calibration output frequency.
  */
#define IS_RTC_OUTPUT_CALIB_FREQ(freq) (((freq) == HAL_RTC_OUTPUT_CALIBRATION_SYNCHRONOUS) \
                                        || ((freq) == HAL_RTC_OUTPUT_CALIBRATION_ASYNCHRONOUS_DIV64))

/**
  * @brief Test output.
  */
#define IS_RTC_OUTPUT(output) (((output) == HAL_RTC_OUTPUT_OUT1_ALARMA)                    \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_ALARMB)                 \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_WAKEUP)                 \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_TAMP)                   \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_CALIB)                  \
                               || ((output) == HAL_RTC_OUTPUT_OUT2_ALARMA)                 \
                               || ((output) == HAL_RTC_OUTPUT_OUT2_ALARMB)                 \
                               || ((output) == HAL_RTC_OUTPUT_OUT2_WAKEUP)                 \
                               || ((output) == HAL_RTC_OUTPUT_OUT2_TAMP)                   \
                               || ((output) == HAL_RTC_OUTPUT_OUT2_CALIB)                  \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_ALARMA_TAMP)            \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_ALARMB_TAMP)            \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_WAKEUP_TAMP)            \
                               || ((output) == HAL_RTC_OUTPUT_OUT2_ALARMA_TAMP)            \
                               || ((output) == HAL_RTC_OUTPUT_OUT2_ALARMB_TAMP)            \
                               || ((output) == HAL_RTC_OUTPUT_OUT2_WAKEUP_TAMP)            \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_ALARMA_OUT2_CALIB)      \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_ALARMB_OUT2_CALIB)      \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_WAKEUP_OUT2_CALIB)      \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_TAMP_OUT2_CALIB)        \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_ALARMA_TAMP_OUT2_CALIB) \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_ALARMB_TAMP_OUT2_CALIB) \
                               || ((output) == HAL_RTC_OUTPUT_OUT1_WAKEUP_TAMP_OUT2_CALIB))


/*! Privilege item attribute check macro */
#define IS_RTC_ITEM_PRIV_ATTR(attribute) ((attribute == HAL_RTC_PRIV) || (attribute == HAL_RTC_NPRIV))

/*! Set privilege item attribute check macro */
#define IS_RTC_PRIV_SET_ITEM(item) ((((item) & (HAL_RTC_PRIV_ITEM_ALL)) != 0x0U) \
                                    && (((item) & ~(HAL_RTC_PRIV_ITEM_ALL)) == 0x0U))

/*! Get privilege item attribute check macro */
#define IS_RTC_PRIV_GET_ITEM(item) (((item) == HAL_RTC_PRIV_ITEM_ALRAPRIV)    \
                                    || ((item) == HAL_RTC_PRIV_ITEM_ALRBPRIV) \
                                    || ((item) == HAL_RTC_PRIV_ITEM_WUTPRIV)  \
                                    || ((item) == HAL_RTC_PRIV_ITEM_TSPRIV)   \
                                    || ((item) == HAL_RTC_PRIV_ITEM_CALPRIV)  \
                                    || ((item) == HAL_RTC_PRIV_ITEM_INITPRIV) \
                                    || ((item) == HAL_RTC_PRIV_ITEM_PRIV))
/**
  * @}
  */

/** @defgroup RTC_Private_Macros_Assert_Alarms RTC private macros for alarm enumerations.
  * @{
 */

/**
  * @brief Test alarm type.
  */
#define IS_RTC_ALARM_DAY_TYPE(alarm) (((alarm) == HAL_RTC_ALARM_DAY_TYPE_SEL_MONTHDAY) \
                                      || ((alarm) == HAL_RTC_ALARM_DAY_TYPE_SEL_WEEKDAY))

/**
  * @brief Test alarm.
  */
#define IS_RTC_ALARM(alarm) (((alarm) == HAL_RTC_ALARM_A) \
                             || ((alarm) == HAL_RTC_ALARM_B))

/**
  * @brief Test alarm auto-clear.
  */
#define IS_RTC_ALARM_AUTO_CLEAR(clear) (((clear) == HAL_ALARM_AUTO_CLEAR_DISABLE) \
                                        || ((clear) == HAL_ALARM_AUTO_CLEAR_ENABLE))

/**
  * @brief Test alarm subseconds auto-reload; enable is allowed only in binary mode.
  */
#define IS_RTC_ALARM_BINARY_AUTO_RELOAD(reload) (((reload) == HAL_RTC_ALARM_SUBSECONDS_AUTO_RELOAD_DISABLE) \
                                                 || (((reload) == HAL_RTC_ALARM_SUBSECONDS_AUTO_RELOAD_ENABLE) \
                                                     && (LL_RTC_GetBinaryMode() == LL_RTC_BINARY_ONLY)))

/*! Test alarm subseconds mask depending on the mode */
#define IS_RTC_ALARM_SUBSECONDS_MASK(mask) ((LL_RTC_GetBinaryMode() == LL_RTC_BINARY_NONE) \
                                            ? ((mask) <= 0xFU) \
                                            : ((mask) <= 0x3FU))

/*! Test alarm subseconds value depending on the mode */
#define IS_RTC_ALARM_SUBSECONDS(subsec) (((LL_RTC_GetBinaryMode() == LL_RTC_BINARY_NONE) \
                                          ? ((subsec) <= 0x7FFFU) \
                                          : 1U))

/**
  * @}
  */

