MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
/** @defgroup RTC_Private_Macros_Assert_Timestamp RTC private macros for timestamp enumerations.
  * @{
  */

/**
  * @brief Test timestamp pin edge.
  */
#define IS_RTC_TIMESTAMP_SOURCE_PIN_EDGE(edge) (((edge) == HAL_RTC_TIMESTAMP_EDGE_RISING) \
                                                || ((edge) == HAL_RTC_TIMESTAMP_EDGE_FALLING))

/**
  * @}
  */

/** @defgroup RTC_Private_Macros_Assert_Wakeup_Timer RTC private macros for wake-up timer enumerations.
  * @{
  */

/**
  * @brief Test wake-up timer clock source.
  */
#define IS_RTC_WAKEUP_TIMER_CLOCK(clock) (((clock) == HAL_RTC_WAKEUP_TIMER_CLOCK_RTCCLK_DIV2)             \
                                          || ((clock) == HAL_RTC_WAKEUP_TIMER_CLOCK_RTCCLK_DIV4)          \
                                          || ((clock) == HAL_RTC_WAKEUP_TIMER_CLOCK_RTCCLK_DIV8)          \
                                          || ((clock) == HAL_RTC_WAKEUP_TIMER_CLOCK_RTCCLK_DIV16)         \
                                          || ((clock) == HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE)           \
                                          || ((clock) == HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE_ADD_1BIT))

/*! Test wake-up timer value */
#define IS_RTC_WAKEUP_VALUE(value) ((value) <= 0xFFFFU)

/*! Test wake-up timer auto-clear value */
#define IS_RTC_WAKEUP_AUTOCLEAR_VALUE(value) ((value) <= 0xFFFFU)

/**
  * @brief Test wake-up timer auto-reload and auto-clear value comparison.
  */
#define IS_RTC_WAKEUP_AUTORELOAD_AUTOCLEAR(auto_reload, auto_clear) ((auto_clear) <= (auto_reload))
/**
  * @}
  */

/** @defgroup RTC_Private_Macros_Assert_Calibration RTC private macros for calibration enumerations.
  * @{
  */

/**
  * @brief Test calibration period.
  */
#define IS_RTC_CALIBRATION_PERIOD(period) (((period) == HAL_RTC_CALIBRATION_PERIOD_8SEC)     \
                                           || ((period) == HAL_RTC_CALIBRATION_PERIOD_16SEC) \
                                           || ((period) == HAL_RTC_CALIBRATION_PERIOD_32SEC))

/**
  * @brief Test calibration pulse.
  */
#define IS_RTC_CALIBRATION_PULSE(pulse) (((pulse) == HAL_RTC_CALIBRATION_PULSE_NOT_INSERTED) \
                                         || ((pulse) == HAL_RTC_CALIBRATION_PULSE_INSERTED))

/*! Test calibration subtracted pulses */
#define IS_RTC_CALIBRATION_SUBTRACTED_PULSES(pulses) ((pulses)<= 0x1FFU)

/**
  * @brief Test calibration shift second.
  */
#define IS_RTC_CALIBRATION_SHIFT_SECOND(shift) (((shift) == HAL_RTC_CALIBRATION_SHIFT_SECOND_DELAY) \
                                                || ((shift) == HAL_RTC_CALIBRATION_SHIFT_SECOND_ADVANCE))

/*! Test calibration shift fractions of seconds */
#define IS_RTC_CALIBRATION_SHIFT_FRACTIONS(shifts) ((shifts) <= 0x7FFFU)

/**
  * @}
  */

/** @defgroup RTC_Private_Macros_Assert_Combination_Constants RTC private macros combination defines.
  * @{
  */

/**
  * @brief Test alarm mask combination.
  */
#define IS_RTC_ALARM_MASK(mask) (((mask) == HAL_RTC_ALARM_MASK_NONE)                                      \
                                 || (((mask) & HAL_RTC_ALARM_MASK_DAY) == HAL_RTC_ALARM_MASK_DAY)         \
                                 || (((mask) & HAL_RTC_ALARM_MASK_HOURS) == HAL_RTC_ALARM_MASK_HOURS)     \
                                 || (((mask) & HAL_RTC_ALARM_MASK_MINUTES) == HAL_RTC_ALARM_MASK_MINUTES) \
                                 || (((mask) & HAL_RTC_ALARM_MASK_SECONDS) == HAL_RTC_ALARM_MASK_SECONDS) \
                                 || (((mask) & HAL_RTC_ALARM_MASK_ALL) == HAL_RTC_ALARM_MASK_ALL))

/**
  * @brief Test wake-up timer interruption.
  */
#define IS_RTC_WAKEUP_IT(it) (((it) == HAL_RTC_WAKEUP_IT_DISABLE) \
                              || ((it) == HAL_RTC_WAKEUP_IT_ENABLE))

/**
  * @brief Test Alarm interruption.
  */
#define IS_RTC_ALARM_IT(it) (((it) == HAL_RTC_ALARM_IT_DISABLE) \
                             || ((it) == HAL_RTC_ALARM_IT_ENABLE))
/**
  * @}
  */

/**
  * @}
  */

/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @defgroup RTC_Private_Functions RTC private functions
  * @brief RTC private functions.
  * @{
  */

static hal_status_t          RTC_WaitSynchro_RS(void);
static hal_status_t          RTC_WaitSynchro_SHP(void);
static hal_status_t          RTC_WaitSynchro_RECALP(void);
static hal_status_t          RTC_WaitSynchro_WUTW(void);
__STATIC_INLINE hal_status_t RTC_GetTime(hal_rtc_time_t *p_time);
__STATIC_INLINE hal_status_t RTC_GetDate(hal_rtc_date_t *p_date);
__STATIC_INLINE uint32_t     RTC_GetWakeUpClockFrequency(hal_rtc_wakeup_timer_clock_t clock_prescaler_wakeup);
__STATIC_INLINE uint32_t     RTC_GetRTCClockCalibrated(void);
__STATIC_INLINE uint32_t     RTC_GetRTCClockAfterPrescalerS(uint32_t frequency);
__STATIC_INLINE uint32_t     RTC_ConvertSecSubsecToBits(uint32_t seconds, uint32_t milliseconds,
                                                        uint32_t microseconds, uint32_t frequency);
__STATIC_INLINE void         RTC_ConvertBitsToTime(hal_rtc_time_t *p_time, uint32_t bits, uint32_t frequency);
/**
  * @}
  */
/* Functions Definition ----------------------------------------------------------------------------------------------*/

/** @addtogroup RTC_Exported_Functions
  * @{
  */

/** @addtogroup RTC_Exported_Functions_Write_Init
  * @brief Write protection and initialization mode.
  * @{
  *
  * # RTC write protection.
  *
  * The RTC peripheral has its own write protection.
  * After backup domain reset, some of the RTC registers are protected against parasitic write access.
  *
  * Calling @ref HAL_RTC_DisableWriteProtection and @ref HAL_RTC_EnableWriteProtection
  * disables and enables the write protection respectively.
  *
  * # Initialization mode
  *
  * The initialization mode of the RTC permits to initialize and configure the RTC calendar.
  * Entering this mode stops the calendar counter.
  *
  * Calling @ref HAL_RTC_EnterInitMode and @ref HAL_RTC_ExitInitMode makes the RTC enter and
  * exit initialization mode, respectively.
  */

/**
  * @brief  Enable the RTC registers write protection.
  * @note   Not all RTC registers are concerned by the write protection.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_EnableWriteProtection(void)
{
  LL_RTC_EnableWriteProtection();

  return HAL_OK;
}

/**
  * @brief  Disable the RTC registers write protection.
  * @note   Not all RTC registers are concerned by the write protection.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_DisableWriteProtection(void)
{
  LL_RTC_DisableWriteProtection();

  return HAL_OK;
}

/**
  * @brief   Enter the RTC initialization mode.
  * @warning The RTC initialization mode is write protected.
  *          Use the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @retval  HAL_OK
  * @retval  HAL_ERROR RTC does not enter initialization mode before the RTC timeout duration.
  */
hal_status_t HAL_RTC_EnterInitMode(void)
{
  uint32_t tickstart;

  if (LL_RTC_IsActiveFlag_INIT() == 0U)
  {
    LL_RTC_EnableInitMode();
    tickstart = HAL_GetTick();
    while ((LL_RTC_IsActiveFlag_INIT() == 0U))
    {
      if ((HAL_GetTick() - tickstart) > RTC_TIMEOUT_VALUE)
      {
        return HAL_ERROR;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief   Exit the RTC initialization mode.
  * @warning The RTC initialization mode is write protected.
  *          Use the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @retval  HAL_OK
  * @retval  HAL_ERROR Calendar resynchronization is still pending after timeout duration.
  */
hal_status_t HAL_RTC_ExitInitMode(void)
{
  LL_RTC_DisableInitMode();

  if (RTC_WaitSynchro_RS() != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup RTC_Exported_Functions_Config
  * @brief  Configuration functions for prescaler values and RTC mode.
  * @{
  *
  * # RTC clock and prescalers
  *
  * The RTC clock, named RTCCLK, is configured by the RCC driver using HAL_RCC_RTC_SetKernelClkSource.
  * The RTCCLK source can be LSE, LSI, or HSE.
  * The RTC peripheral has a programmable prescaler stage that can be configured to generate a 1 Hz clock.
  * To minimize consumption, the prescaler is split into two programmable prescalers:
  * * A 7-bit asynchronous prescaler (PREDIV_A).
  * * A 15-bit synchronous prescaler (PREDIV_S).
  *
  * When using both prescalers, it is recommended to configure the asynchronous
  * prescaler to a high value to minimize consumption.
  * By default, the asynchronous and synchronous prescalers are set to 128 and 256
  * to obtain a clock frequency of 1 Hz with an RTCCLK configured to an LSE of 32.768 kHz.
  *
  * The following equation gives the clock frequency after the first prescaler:
  * freq_async_clk = freq_rtcclk/(1+@ref hal_rtc_config_t::asynch_prediv)
  *
  * The following equation gives the clock frequency after the two prescalers:
  * freq_sync_clk = freq_rtcclk/((1+ @ref hal_rtc_config_t::asynch_prediv)(1+ @ref hal_rtc_config_t::synch_prediv))
  *
  * The values of the prescalers can be changed by calling @ref HAL_RTC_SetConfig and
  * setting the value of @ref hal_rtc_config_t::asynch_prediv and @ref hal_rtc_config_t::synch_prediv.
  * To change the values of the prescalers, the RTC needs to be in
  * initialization mode by calling @ref HAL_RTC_EnterInitMode.
  *
  * # RTC running modes.
  *
  * RTC supports three operating modes:
  * * BCD mode for Binary-Coded Decimal
  * * Binary mode
  * * Mixed mode
  *
  * The mode is chosen by selecting the value of @ref hal_rtc_config_t::mode and calling @ref HAL_RTC_SetConfig.
  *
  * ## Binary-Coded Decimal mode
  *
  * The BCD mode is a feature that allows the RTC to store and display time and date information in a BCD format.
  * BCD is a way of representing decimal numbers using four bits per digit, with each digit ranging from 0 to 9.
  * In BCD mode, the subseconds down-counter is clocked by the signal after the first prescaler.
  * When the down-counter reaches 0, it is reloaded with the value of the synchronous prescaler.
  * Only the first 16 bits of the subsecond register are used in BCD mode.
  *
  * ## Binary mode
  *
  * In binary mode, the subseconds down-counter is clocked by the signal after the first prescaler.
  * The subsecond register is extended to 32-bit length and is free running.
  * The value of the synchronous register is not used, and the time and date registers are not used.
  * In this mode, users can use all functions that include the keyword Binary in their names that are optimized for it.
  *
  * ## Mixed mode
  *
  * This mode, as stated by its name, is a mix between the two previous modes.
  * The subseconds down-counter is extended to 32-bit length and is free running.
  * The time and date calendar in BCD are also functional.
  * The down-counter is still clocked by the signal after the asynchronous prescaler,
  * but the seconds of the calendar are incremented each time the least significant
  * bits of the subsecond register reach 0. The number of bits taken into account
  * are defined by configuring @ref HAL_RTC_SetConfig and changing the value of @ref hal_rtc_config_t::bcd_update.
  *
  * To change the RTC mode, the RTC needs to be in initialization mode by calling @ref HAL_RTC_EnterInitMode.
  */

/**
  * @brief   Program the RTC prescaler values and the RTC mode according to the specified parameters.
  * @param   p_config pointer to an RTC configuration instance.
  * @warning The RTC configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this
  *          function.
  * @warning The RTC configuration must be called when RTC is in initialization mode,
  *          use @ref HAL_RTC_EnterInitMode to enter initialization mode.
  * @retval  HAL_OK.
  * @retval  HAL_INVALID_PARAM p_config is NULL.
  */
hal_status_t HAL_RTC_SetConfig(const hal_rtc_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_RTC_ASYNCH_PREDIV(p_config->asynch_prediv));
  ASSERT_DBG_PARAM(IS_RTC_MODE(p_config->mode));
  ASSERT_DBG_PARAM(IS_RTC_SYNCH_PREDIV(p_config->synch_prediv, p_config->mode));
  ASSERT_DBG_PARAM(IS_RTC_BCD_UPDATE(p_config->bcd_update, p_config->mode));
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)

  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

