MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  if (p_config->mode == HAL_RTC_MODE_BCD)
  {
    LL_RTC_SetPrescalers(p_config->asynch_prediv, p_config->synch_prediv);
    LL_RTC_SetBinaryMode(LL_RTC_BINARY_NONE);
  }
  else
  {
    LL_RTC_SetAsynchPrescaler(p_config->asynch_prediv);
    LL_RTC_SetConfigBinaryMode((uint32_t) p_config->mode, (uint32_t) p_config->bcd_update);
  }

  return HAL_OK;
}

/**
  * @brief Retrieve the RTC prescaler values and the RTC mode.
  * @param p_config pointer to an RTC configuration instance.
  */
void HAL_RTC_GetConfig(hal_rtc_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);

  uint32_t prescalers_values = LL_RTC_GetPrescalers();
  uint32_t binary_mode_bcdu = LL_RTC_GetConfigBinaryMode();
  uint32_t binary_mode = LL_RTC_GET_BIN(binary_mode_bcdu);
  uint32_t bcd_update = LL_RTC_GET_BCDU(binary_mode_bcdu);
  p_config->asynch_prediv = LL_RTC_GET_ASYNCH_PRESCALER(prescalers_values);
  p_config->synch_prediv = LL_RTC_GET_SYNCH_PRESCALER(prescalers_values);
  p_config->mode = (hal_rtc_mode_t) binary_mode;
  p_config->bcd_update = (hal_rtc_bcd_update_t) bcd_update;
}

/**
  * @}
 */

/** @addtogroup RTC_Exported_Functions_Low_Power
  * @brief   Low power configuration functions.
  * @{
  *
  * It is possible to drastically reduce the RTC power consumption by setting the RTC to
  * low power mode. In this configuration the whole RTC is clocked by the ck_apre.
  *
  * When the division factor of the asynchronous prescaler is not
  * a power of 2 (( @ref hal_rtc_config_t::asynch_prediv +1) % 2 == 0),
  * the low power mode cannot be activated.
  *
  */

/**
  * @brief   Enable the RTC ultra low power mode.
  * @note    When (@ref hal_rtc_config_t::asynch_prediv + 1) is not a power of 2, calling this function does not
  *          enable low power mode.
  * @warning The RTC low power configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this
  *          function.
  * @retval  HAL_OK
  */
hal_status_t HAL_RTC_EnableUltraLowPowerMode(void)
{
  LL_RTC_CAL_LowPower_Enable();

  return HAL_OK;
}

/**
  * @brief   Disable the RTC ultra low power mode.
  * @warning The RTC configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this
  *          function.
  * @retval  HAL_OK
  */
hal_status_t HAL_RTC_DisableUltraLowPowerMode(void)
{
  LL_RTC_CAL_LowPower_Disable();

  return HAL_OK;
}

/**
  * @brief  Check whether the RTC ultra low power mode is enabled.
  * @retval hal_rtc_ultra_low_power_mode_status_t Ultra
  *         low power mode status.
  */
hal_rtc_ultra_low_power_mode_status_t HAL_RTC_IsEnabledUltraLowPowerMode(void)
{
  return (hal_rtc_ultra_low_power_mode_status_t) LL_RTC_CAL_LowPower_IsEnabled();
}

/**
  * @}
  */

/** @addtogroup RTC_Exported_Functions_Calendar
  * @brief   Exported calendar functions.
  * @{
  *
  * The RTC calendar stores and displays time and date information in a BCD format.
  * It includes subseconds, seconds, minutes, hours, weekday, date, month, and year.
  * The calendar works only in BCD or mixed mode; otherwise, only the subseconds down-counter register works.
  *
  * # Calendar configuration
  *
  * ## Calendar hour format and shadow registers.
  *
  * Set the hour format to 24-hour or 12-hour format by programming
  * @ref hal_rtc_calendar_config_t::hour_format and calling @ref HAL_RTC_CALENDAR_SetConfig.
  *
  * ## Shadow registers
  *
  * The shadow registers mirror the values of the calendar date and time registers.
  * When the shadow registers are not bypassed, the application reads the values of
  * date and time in the shadow registers. Reading the time locks the values in
  * calendar shadow registers to ensure consistency between time and date values;
  * reading the date unlocks them. Call @ref HAL_RTC_CALENDAR_GetTime before
  * @ref HAL_RTC_CALENDAR_GetDate, or call @ref HAL_RTC_CALENDAR_GetDateTime to retrieve the time and date correctly.
  * The application can access the date and time registers directly by bypassing
  * the shadow registers. Use @ref hal_rtc_calendar_config_t::bypass_shadow_register
  * to configure the shadow register bypass.
  *
  * # Other calendar services
  *
  * ## Reference clock detection
  *
  * In BCD mode only, the update of the RTC calendar can be synchronized to a reference clock.
  * This reference clock is used to compensate for the imprecision of the calendar seconds update frequency.
  * This detection is only enabled if the prescalers are set to their default values,
  * which are 128 and 256 for @ref hal_rtc_config_t::asynch_prediv and @ref hal_rtc_config_t::synch_prediv respectively.
  * ## Binary mode
  *
  * A dedicated API is provided to optimize the code when using binary mode.
  * The function @ref HAL_RTC_CALENDAR_GetBinaryTime retrieves the value of the subseconds down-counter register.
  * ## Summer time and hour increment and decrement
  *
  * The functions @ref HAL_RTC_CALENDAR_EnableSummerTimeMemorization and
  * @ref HAL_RTC_CALENDAR_DisableSummerTimeMemorization allow an application to
  * keep information about the summer time status. These functions do not alter the hour registers.
  * Increment or decrement the hours by using @ref HAL_RTC_CALENDAR_AddOneHour and @ref HAL_RTC_CALENDAR_SubtractOneHour
  * respectively, which are independent of the summer time memorization bit.
  * ## Subseconds underflow
  *
  * In binary or mixed mode, enable the subsecond underflow interrupt.
  * This interrupt triggers when the subseconds down-counter underflows.
  */

/**
  * @brief   Program the bypass shadow registers and calendar hour format according to the specified parameters.
  * @param   p_config_calendar pointer to an RTC calendar configuration instance.
  * @warning The RTC calendar configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @warning The RTC calendar configuration needs to be called when RTC is in initialization mode,
  *          use @ref HAL_RTC_EnterInitMode to enter initialization mode.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM when p_config_calendar is NULL.
  */
hal_status_t HAL_RTC_CALENDAR_SetConfig(const hal_rtc_calendar_config_t *p_config_calendar)
{
  ASSERT_DBG_PARAM(p_config_calendar != NULL);
  ASSERT_DBG_PARAM(IS_RTC_CALENDAR_HOUR_FORMAT(p_config_calendar->hour_format));
  ASSERT_DBG_PARAM(IS_RTC_CALENDAR_SHADOW_REG(p_config_calendar->bypass_shadow_register));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config_calendar == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_RTC_SetHourFormatAndShadowRegBypass((uint32_t) p_config_calendar->hour_format,
                                         (uint32_t) p_config_calendar->bypass_shadow_register);

  return HAL_OK;
}

/**
  * @brief Retrieve the bypass shadow registers and calendar hour format configuration.
  * @param p_config_calendar pointer to an RTC calendar configuration instance.
  */
void HAL_RTC_CALENDAR_GetConfig(hal_rtc_calendar_config_t *p_config_calendar)
{
  ASSERT_DBG_PARAM(p_config_calendar != NULL);

  uint32_t value_format_shadow_reg = LL_RTC_READ_REG(CR);
  uint32_t bypass_shadow_register = LL_RTC_GET_SHADOW_REG_BYPASS(value_format_shadow_reg);
  uint32_t hour_format = LL_RTC_GET_CALENDAR_HOUR_FORMAT(value_format_shadow_reg);

  p_config_calendar->bypass_shadow_register = (hal_rtc_calendar_shadow_reg_bypass_t)
                                              bypass_shadow_register;
  p_config_calendar->hour_format = (hal_rtc_calendar_hour_format_t) hour_format;

