MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
}

/**
  * @brief   Program the RTC time.
  * @param   p_time pointer to an RTC time instance.
  * @note    @ref hal_rtc_time_t::microsec field is ignored because it is not used in the SetTime function.
  * @note    @ref hal_rtc_time_t::millisec field is ignored because it is not used in the SetTime function.
  * @note    @ref hal_rtc_time_t::subsec field is ignored because it is not used in the SetTime function.
  * @warning The RTC time configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @warning The RTC time configuration needs to be called when RTC is in initialization mode,
  *          use @ref HAL_RTC_EnterInitMode to enter initialization mode.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM when p_time is NULL.
  */
hal_status_t HAL_RTC_CALENDAR_SetTime(const hal_rtc_time_t *p_time)
{
  ASSERT_DBG_PARAM(p_time != NULL);
  ASSERT_DBG_PARAM(IS_RTC_TIME_FORMAT(p_time->am_pm));
  ASSERT_DBG_PARAM(IS_RTC_HOUR(p_time->hour, (hal_rtc_calendar_hour_format_t) LL_RTC_GetHourFormat()));
  ASSERT_DBG_PARAM(IS_RTC_MIN(p_time->min));
  ASSERT_DBG_PARAM(IS_RTC_SEC(p_time->sec));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_time == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_RTC_TIME_Config((uint32_t) p_time->am_pm, HAL_RTC_CONVERT_DEC2BCD(p_time->hour),
                     HAL_RTC_CONVERT_DEC2BCD(p_time->min), HAL_RTC_CONVERT_DEC2BCD(p_time->sec));

  return HAL_OK;
}

/**
  * @brief  Retrieve the RTC time.
  * @param  p_time pointer to an RTC time instance.
  * @note   When using the shadow registers (default):
  *         Reading RTC current time locks the values in calendar shadow
  *         registers to ensure consistency between time and date values.
  *         Call @ref HAL_RTC_CALENDAR_GetDate to unlock the time value.
  * @retval HAL_OK
  * @retval HAL_ERROR When a timeout occurs on the shadow register flag
  */
hal_status_t HAL_RTC_CALENDAR_GetTime(hal_rtc_time_t *p_time)
{
  ASSERT_DBG_PARAM(p_time != NULL);
  return RTC_GetTime(p_time);
}

/**
  * @brief   Program the RTC date.
  * @param   p_date pointer to an RTC date instance.
  * @warning The RTC date configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @warning The RTC date configuration needs to be called when RTC is in initialization mode,
  *          use @ref HAL_RTC_EnterInitMode to enter initialization mode.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM when p_date is NULL.
  */
hal_status_t HAL_RTC_CALENDAR_SetDate(const hal_rtc_date_t *p_date)
{
  ASSERT_DBG_PARAM(p_date != NULL);
  ASSERT_DBG_PARAM(IS_RTC_YEAR(p_date->year));
  ASSERT_DBG_PARAM(IS_RTC_MONTH(p_date->mon));
  ASSERT_DBG_PARAM(IS_RTC_WEEKDAY(p_date->wday));
  ASSERT_DBG_PARAM(IS_RTC_MONTHDAY_NBR(p_date->mday));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_date == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* No need to use HAL_RTC_CONVERT_DEC2BCD for wday because the max value is less than 10; BCD equals decimal */
  LL_RTC_DATE_Config((uint32_t)p_date->wday, HAL_RTC_CONVERT_DEC2BCD(p_date->mday),
                     (uint32_t)p_date->mon, HAL_RTC_CONVERT_DEC2BCD(p_date->year));

  return HAL_OK;
}

/**
  * @brief  Retrieve the RTC date.
  * @param  p_date pointer to an RTC date instance.
  * @retval HAL_OK
  * @retval HAL_ERROR When a timeout occurs on the shadow register flag
  */
hal_status_t HAL_RTC_CALENDAR_GetDate(hal_rtc_date_t *p_date)
{
  ASSERT_DBG_PARAM(p_date != NULL);

  return RTC_GetDate(p_date);
}

/**
  * @brief   Program the RTC date and time.
  * @param   p_date pointer to an RTC date instance.
  * @param   p_time pointer to an RTC time instance.
  * @note    @ref hal_rtc_time_t::microsec field is ignored because it is not used in the SetDateTime function.
  * @note    @ref hal_rtc_time_t::millisec field is ignored because it is not used in the SetDateTime function.
  * @note    @ref hal_rtc_time_t::subsec field is ignored because it is not used in the SetDateTime function.
  * @warning The RTC date and time configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @warning The RTC date and time configuration needs to be called when RTC is in initialization mode,
  *          use @ref HAL_RTC_EnterInitMode to enter initialization mode.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM when p_date or p_time are NULL.
  */
hal_status_t HAL_RTC_CALENDAR_SetDateTime(const hal_rtc_date_t *p_date, const hal_rtc_time_t *p_time)
{
  ASSERT_DBG_PARAM(p_date != NULL);
  ASSERT_DBG_PARAM(p_time != NULL);
  ASSERT_DBG_PARAM(IS_RTC_YEAR(p_date->year));
  ASSERT_DBG_PARAM(IS_RTC_MONTH(p_date->mon));
  ASSERT_DBG_PARAM(IS_RTC_WEEKDAY(p_date->wday));
  ASSERT_DBG_PARAM(IS_RTC_MONTHDAY_NBR(p_date->mday));
  ASSERT_DBG_PARAM(IS_RTC_TIME_FORMAT(p_time->am_pm));
  ASSERT_DBG_PARAM(IS_RTC_HOUR(p_time->hour, (hal_rtc_calendar_hour_format_t) LL_RTC_GetHourFormat()));
  ASSERT_DBG_PARAM(IS_RTC_MIN(p_time->min));
  ASSERT_DBG_PARAM(IS_RTC_SEC(p_time->sec));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_date == NULL) || (p_time == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_RTC_TIME_Config((uint32_t) p_time->am_pm, HAL_RTC_CONVERT_DEC2BCD(p_time->hour),
                     HAL_RTC_CONVERT_DEC2BCD(p_time->min), HAL_RTC_CONVERT_DEC2BCD(p_time->sec));

  /* No need to use HAL_RTC_CONVERT_DEC2BCD for wday because the max value is less than 10; BCD equals decimal */
  LL_RTC_DATE_Config((uint32_t)p_date->wday, HAL_RTC_CONVERT_DEC2BCD(p_date->mday),
                     (uint32_t)p_date->mon, HAL_RTC_CONVERT_DEC2BCD(p_date->year));

  return HAL_OK;
}

/**
  * @brief  Retrieve the RTC date and time.
  * @param  p_date pointer to an RTC date instance.
  * @param  p_time pointer to an RTC time instance.
  * @retval HAL_OK
  * @retval HAL_ERROR When a timeout occurs on the shadow register flag
  */
hal_status_t HAL_RTC_CALENDAR_GetDateTime(hal_rtc_date_t *p_date, hal_rtc_time_t *p_time)
{
  ASSERT_DBG_PARAM(p_date != NULL);
  ASSERT_DBG_PARAM(p_time != NULL);

  hal_status_t status_time;
  hal_status_t status_date;

  /* When using the shadow registers always get time first and then date.
     Even if there is a timeout in time read the date in any case to unlock the shadow registers. */
  status_time = RTC_GetTime(p_time);
  status_date = RTC_GetDate(p_date);

  if (status_time != HAL_OK)
  {
    return status_time;
  }

  return status_date;
}

/**
  * @brief   Enable the reference clock detection.
  * @note    The detection only works when RTC is set to BCD mode only
  *          @ref HAL_RTC_MODE_BCD, the synchronous prescaler
  *          @ref hal_rtc_config_t::synch_prediv and the asynchronous prescaler @ref hal_rtc_config_t::asynch_prediv
  *          are set to 0x00FF (default value) and to 0x007F (default-value) respectively.
  * @warning The RTC reference clock configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @warning The RTC reference clock configuration needs to be called when RTC is in initialization mode,
  *          use @ref HAL_RTC_EnterInitMode to enter initialization mode.
  * @retval  HAL_OK
  */
hal_status_t HAL_RTC_CALENDAR_EnableReferenceClock(void)
{
  LL_RTC_EnableRefClock();

  return HAL_OK;
}

/**
  * @brief   Disable the reference clock detection.
  * @warning The RTC reference clock configuration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @warning The RTC reference clock configuration needs to be called when RTC is in initialization mode,
  *          use @ref HAL_RTC_EnterInitMode to enter initialization mode.
  * @retval  HAL_OK
  */
hal_status_t HAL_RTC_CALENDAR_DisableReferenceClock(void)
{
  LL_RTC_DisableRefClock();

  return HAL_OK;
}

/**
  * @brief  Check if the reference clock detection is enabled or disabled.
  * @retval hal_rtc_calendar_reference_clock_status_t Reference clock detection status
  */
hal_rtc_calendar_reference_clock_status_t HAL_RTC_CALENDAR_IsEnabledReferenceClock(void)
{
  return (hal_rtc_calendar_reference_clock_status_t) LL_RTC_IsEnabledRefClock();
}

/**
  * @brief   Add one hour to the calendar in a single operation without going
  *          through the initialization procedure.
  * @warning The RTC hour increment is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @retval  HAL_OK
  */
hal_status_t HAL_RTC_CALENDAR_AddOneHour(void)
{
  LL_RTC_TIME_IncHour();

  return HAL_OK;
}

/**
  * @brief   Subtract one hour from the calendar in a single operation without
  *          through the initialization procedure.
  * @warning The RTC hour decrement is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @retval  HAL_OK
  */
hal_status_t HAL_RTC_CALENDAR_SubtractOneHour(void)
{
  LL_RTC_TIME_DecHour();

  return HAL_OK;
}

/**
  * @brief   Enable the summer time memorization bit status.
  * @warning The RTC summer time memorization bit is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @retval  HAL_OK
  */
hal_status_t HAL_RTC_CALENDAR_EnableSummerTimeMemorization(void)
{
  LL_RTC_TIME_EnableDayLightStore();

  return HAL_OK;
}

/**
  * @brief   Disable the summer time memorization bit status.
  * @warning The RTC summer time memorization bit is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @retval  HAL_OK
  */
hal_status_t HAL_RTC_CALENDAR_DisableSummerTimeMemorization(void)
{
  LL_RTC_TIME_DisableDayLightStore();

  return HAL_OK;
}

/**
  * @brief  Check if the summer time memorization bit is enabled or disabled.
  * @retval hal_rtc_calendar_summer_time_status_t Summer time memorization bit status.
  */
hal_rtc_calendar_summer_time_status_t HAL_RTC_CALENDAR_IsEnabledSummerTimeMemorization(void)
{
  return (hal_rtc_calendar_summer_time_status_t)LL_RTC_TIME_IsEnabledDayLightStore();
}

/**
  * @brief  Retrieve the subsecond register value.
  * @retval uint32_t Value of the subsecond register.
  */
uint32_t HAL_RTC_CALENDAR_GetBinaryTime(void)
{
  return LL_RTC_TIME_GetSubSecond();
}

/**
  * @brief  Enable the subsecond register underflow interruption.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_CALENDAR_EnableITSubSecondsUnderflow(void)
{
  LL_RTC_EnableIT_SSRU();

  return HAL_OK;
}

/**
  * @brief  Disable the subsecond register underflow interruption.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_CALENDAR_DisableITSubSecondsUnderflow(void)
{
  LL_RTC_DisableIT_SSRU();

  return HAL_OK;
}

/**
  * @brief  Check if the subsecond register underflow interruption is enabled or disabled.
  * @retval hal_rtc_calendar_it_underflow_status_t Subsecond register underflow interruption status
  */
hal_rtc_calendar_it_underflow_status_t HAL_RTC_CALENDAR_IsEnabledITSubSecondsUnderflow(void)
{
  return (hal_rtc_calendar_it_underflow_status_t) LL_RTC_IsEnabledIT_SSRU();
}

/**
  * @brief  Check if the calendar is initialized.
  * @retval hal_rtc_calendar_status_t Calendar initialization status.
  */
hal_rtc_calendar_status_t HAL_RTC_CALENDAR_IsInitialized(void)
{
  return (hal_rtc_calendar_status_t) LL_RTC_IsActiveFlag_INITS();
}

/**
  * @}
  */

