MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
/** @addtogroup RTC_Exported_Functions_Output
  * @brief Exported output functions.
  * @{
  *
  * To enable the output signals, call @ref HAL_RTC_OUTPUT_Enable. To use RTC_OUT1 as input,
  * all outputs must be disabled on RTC_OUT1. Disable all outputs by calling @ref HAL_RTC_OUTPUT_Disable,
  * or configure the outputs on RTC_OUT2 by calling @ref HAL_RTC_OUTPUT_Enable with @ref hal_rtc_output_t values that
  * contain only OUT2 in their names.
  *
  * # Configuration of the TAMPALRM output signal
  *
  * The TAMPALRM output is the OR between rtc_tamp_evt and ALARM output.
  *
  * ALARM output can be selected between alarm A, alarm B, or wake-up outputs.
  *
  * Depending on the application needs, configure the polarity, the output type, and the use of a pull-up
  * by using @ref HAL_RTC_OUTPUT_SetConfigTampalarm.
  * When configuring the output to open-drain, set the GPIO as input by using
  * HAL_GPIO_Init from the GPIO driver.
  *
  * # Configuration of the calibration output signal
  *
  * The calibration output signal corresponds to the RTCCLK clock signal after the
  * 6th stage of the asynchronous prescaler or the 8th stage of the synchronous
  * prescaler (and all the asynchronous prescaler).
  *
  * To choose between these two configurations, call @ref HAL_RTC_OUTPUT_SetConfigCalib.
  *
  * ## Asynchronous clock calibration
  *
  * The calibration clock is the output of the 6th stage of the asynchronous prescaler.
  * Thus, only the first 6 bits are used to define the calibration frequency.
  * The frequency of the output is (freq_RTCCLK / (PREDIV_A[5:0]+1)),
  * PREDIV_A given by @ref hal_rtc_config_t::asynch_prediv.
  *
  * If low power mode is disabled and the value of the asynchronous prescaler is
  * strictly below 0x20, the calibration signal output does not work.
  *
  * With the prescaler at default values and using LSE, the clock frequency is 512 Hz.
  *
  * ## Synchronous clock calibration
  *
  * The calibration output is the output of the 8th stage of the synchronous prescaler.
  * Thus, only the first 8 bits are used to define the calibration frequency.
  * The frequency of the output is (freq_RTCCLK/((PREDIV_A+1) * (PREDIV_S[7:0] +1)).
  * PREDIV_S and PREDIV_A given by @ref hal_rtc_config_t::synch_prediv and @ref hal_rtc_config_t::asynch_prediv
  * respectively.
  *
  * With the prescaler at default values and using LSE, the clock frequency is 1 Hz.
  *
  */

/**
  * @brief   Program the tampalarm configuration.
  * @param   p_config pointer to the tampalarm configuration instance.
  * @warning When configuring tampalarm in open-drain mode
  *          @ref HAL_RTC_OUTPUT_TAMPALARM_TYPE_OPENDRAIN
  *          The RTC_OUT1 GPIO must be set to input in GPIO driver.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM when p_config is NULL.
  */
hal_status_t HAL_RTC_OUTPUT_SetConfigTampalarm(const hal_rtc_output_tampalarm_config_t  *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_RTC_OUTPUT_TAMPALARM_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_RTC_OUTPUT_TAMPALARM_TYPE(p_config->type));
  ASSERT_DBG_PARAM(IS_RTC_OUTPUT_TAMPALARM_PULLUP(p_config->pullup));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_RTC_ConfigTampalarm((uint32_t) p_config->polarity, (uint32_t) p_config->type,
                         (uint32_t) p_config->pullup);

  return HAL_OK;
}

/**
  * @brief Retrieve the tampalarm configuration.
  * @param p_config pointer to the tampalarm configuration instance.
  */
void HAL_RTC_OUTPUT_GetConfigTampalarm(hal_rtc_output_tampalarm_config_t  *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);

  uint32_t value_output_tampalarm = LL_RTC_READ_REG(CR);
  uint32_t polarity_temp = value_output_tampalarm & LL_RTC_OUTPUTPOLARITY_PIN_LOW;
  uint32_t type_temp = value_output_tampalarm & LL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN;
  uint32_t pullup_temp = value_output_tampalarm & LL_RTC_ALARM_OUTPUT_PULLUP_ON;

  p_config->polarity = (hal_rtc_output_tampalarm_polarity_t) polarity_temp;
  p_config->type = (hal_rtc_output_tampalarm_type_t) type_temp;
  p_config->pullup = (hal_rtc_output_tampalarm_pullup_t) pullup_temp;
}

/**
  * @brief   Program the calibration output configuration.
  * @param   p_config pointer to the calibration output configuration instance.
  * @note    When using the synchronous calibration (1Hz by default), the calibration output is the output of the 8th
  *          stage of the synchronous prescaler. Thus only the 8 first bits are used to define the calibration frequency
  *          The frequency of the output is (f_RTCCLK/((PREDIV_A+1) * (PREDIV_S[7:0] +1)).
  * @note    When using the asynchronous calibration (512Hz by default), the calibration output is the output
  *          of the asynchronous prescaler 6th stage. Thus only the 6 first bits are
  *          used to define the calibration frequency. The frequency of the output is (f_RTCCLK / (PREDIV_A[5:0]+1)).
  * @warning If low power mode is disabled and the value of the asynchronous prescaler
  *          @ref hal_rtc_config_t::asynch_prediv is strictly below 0x20, the calibration signal output does not work.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM when p_config is NULL.
  */
hal_status_t HAL_RTC_OUTPUT_SetConfigCalib(const hal_rtc_output_calib_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_RTC_OUTPUT_CALIB_FREQ(p_config->frequency));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_RTC_CAL_SetOutputFreq((uint32_t) p_config->frequency);

  return HAL_OK;
}

/**
  * @brief Retrieve the calibration output configuration.
  * @param p_config pointer to the calibration output configuration instance.
  */
void HAL_RTC_OUTPUT_GetConfigCalib(hal_rtc_output_calib_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);

  p_config->frequency = (hal_rtc_output_calibration_frequency_t) LL_RTC_CAL_GetOutputFreq();
}

/**
  * @brief  Enable the output of the calibration signal or/and tampalarm signal.
  * @param  output Value of @ref hal_rtc_output_t.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_OUTPUT_Enable(hal_rtc_output_t output)
{
  ASSERT_DBG_PARAM(IS_RTC_OUTPUT(output));

  uint32_t reg_value = LL_RTC_READ_REG(CR);

