MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  uint32_t mask = (LL_RTC_CALIB_OUTPUT_512HZ   |
                   LL_RTC_OUTPUT_TAMPER_ENABLE |
                   LL_RTC_ALARMOUT_WAKEUP      |
                   LL_RTC_ALARM_OUTPUT_REMAP_POS1);
  reg_value |= (mask & (uint32_t)output);

  LL_RTC_WRITE_REG(CR, (reg_value));

  return HAL_OK;
}

/**
  * @brief  Disable the output RTC output.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_OUTPUT_Disable(void)
{
  LL_RTC_DisableOutput();

  return HAL_OK;
}

/**
  * @brief  Check if the RTC output is enabled or disabled.
  * @param  output Value of @ref hal_rtc_output_t representing the output configuration to be checked.
  * @retval hal_rtc_output_status_t:HAL_RTC_OUTPUT_DISABLED RTC output status.
  */
hal_rtc_output_status_t HAL_RTC_OUTPUT_IsEnabled(hal_rtc_output_t output)
{
  ASSERT_DBG_PARAM(IS_RTC_OUTPUT(output));
  return (hal_rtc_output_status_t) LL_RTC_IsEnabledDetailedOutput((uint32_t) output);
}

/**
  * @}
  */

/** @addtogroup RTC_Exported_Functions_Calibration
  * @brief Exported calibration functions.
  * @{
  *
  * # Smooth digital calibration
  *
  * The RTC frequency can be calibrated with a very small resolution of about 0.954 ppm with a range
  * from -487.1 ppm to 488.5 ppm. This adjustment is made on the RTCCLK or the clock after
  * the asynchronous prescaler when low power mode is enabled.
  *
  * To activate the smooth calibration, one needs to call  @ref HAL_RTC_EnableCalibration with
  * the parameters pulse_add
  * or subtracted_pulses set to @ref HAL_RTC_CALIBRATION_PULSE_INSERTED
  * or a value different from 0 respectively.
  * The subtracted_pulses specifies the number of pulses of the clock to be masked during the calibration cycle
  * chosen by the calibration_period. If calibration_period is set to
  * @ref HAL_RTC_CALIBRATION_PERIOD_16SEC or
  * @ref HAL_RTC_CALIBRATION_PERIOD_8SEC the first bit and the two first bit
  * are stuck at 0 respectively.
  *
  * Setting the pulse_add parameter inserts one extra pulse
  * every 2^11 cycles which doesn't dependent on the calibration period.
  *
  * The frequency after calibration is given by this formula
  * freq_calib = freq_RTCCLK x [1 + ( pulse_add x 512 - subtracted_pulses) /
  * (2^20 + subtracted_pulses - pulse_add x 512)]
  *
  * When the value of the asynchronous prescaler @ref hal_rtc_config_t::asynch_prediv is inferior to 3
  * no pulses are inserted, thus making the parameter pulse_add is ignored.
  *
  * To stop the calibration call  @ref HAL_RTC_DisableCalibration.
  * To retrieve the status of the calibration call @ref HAL_RTC_IsEnabledCalibration.
  *
  * # Synchronization of RTC the calendar
  *
  * After reading the subsecond register and calculating an offset with the remote clock, the goal of this feature
  * is to synchronize the RTC by adding/subtracting the offset to synchronize the RTC with the remote clock.
  * The shift operation consists of adding or subtracting some
  * subseconds depending on the parameters of the @ref HAL_RTC_ShiftCalibration.
  * The param add_one_sec adds one second to the time register and the param fraction_sec_to_subtract subtract
  * some subseconds to the subsecond register.
  *
  * The shift operation does not work properly in the following cases:
  * 1. In BCD mode :HAL_RTC_MODE_BCD, if the reference clock is enabled.
  * 2. In BCD mode :HAL_RTC_MODE_BCD, the 15th value of the subsecond register is
  *    equal to 1.
  * 3. In mixed mode :HAL_RTC_MODE_MIX, the fraction_sec_to_subtract
  *    [14, @ref hal_rtc_config_t::bcd_update ] must be equal to 0.
  * 4. In mixed mode :HAL_RTC_MODE_MIX, the BCD increment value
  *    @ref hal_rtc_config_t::bcd_update in the subsecond register must be equal to 0.
  *
  */

/**
  * @brief   Enable the smooth calibration parameters.
  * @param   calibration_period Select the smooth calibration period, values from @ref hal_rtc_calibration_period_t.
  * @param   pulse_add Choose between increasing the frequency by one pulse every 2^11 pulses
  *          or no pulse insertion (@ref hal_rtc_calibration_pulse_t).
  * @param   subtracted_pulses Number of pulses to subtract out of 2^20 pulses.
  * @note    To activate the smooth calibration, the parameters pulse_add
  *          or subtracted_pulses must be set to @ref HAL_RTC_CALIBRATION_PULSE_INSERTED
  *          or a value different from 0, respectively.
  *          If calibration_period is set to @ref HAL_RTC_CALIBRATION_PERIOD_16SEC or
  *          @ref HAL_RTC_CALIBRATION_PERIOD_8SEC the first bit and the first two bits
  *          are stuck at 0, respectively.
  *          If PREDIV_A (@ref hal_rtc_config_t::asynch_prediv) is less than 3,
  *          the bit CALP set by pulse_add is always equal to 0, thus pulse_add is ignored.
  *          The frequency after calibration is given by this formula:
  *          F_CAL = F_RTCCLK x [1 + ( pulse_add x 512 - subtracted_pulses) /
  *          (2^20 + subtracted_pulses - pulse_add x 512)]
  * @warning The RTC calibration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @warning When low power mode is enabled (use @ref HAL_RTC_EnableUltraLowPowerMode), the calibration mechanism
  *          is applied to the RTCCLK after the asynchronous prescaler.
  * @retval  HAL_OK
  * @retval  HAL_ERROR If a recalibration operation is still ongoing after RTC timeout duration.
  */
hal_status_t HAL_RTC_EnableCalibration(hal_rtc_calibration_period_t calibration_period,
                                       hal_rtc_calibration_pulse_t pulse_add,
                                       uint32_t subtracted_pulses)
{
  ASSERT_DBG_PARAM(IS_RTC_CALIBRATION_PERIOD(calibration_period));
  ASSERT_DBG_PARAM(IS_RTC_CALIBRATION_PULSE(pulse_add));
  ASSERT_DBG_PARAM(IS_RTC_CALIBRATION_SUBTRACTED_PULSES(subtracted_pulses));

  if (RTC_WaitSynchro_RECALP() != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_RTC_CAL_SetSmoothCalibration((uint32_t) calibration_period, (uint32_t) pulse_add, subtracted_pulses);

  return HAL_OK;
}

/**
  * @brief   Disable the smooth calibration parameters.
  * @warning The RTC calibration is write protected, use
  *          the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @retval  HAL_OK
  * @retval  HAL_ERROR If a recalibration operation is still ongoing after RTC timeout duration.
  */
hal_status_t HAL_RTC_DisableCalibration(void)
{
  if (RTC_WaitSynchro_RECALP() != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* This is the only way to deactivate the calibration */
  LL_RTC_CAL_SetSmoothCalibration(0U, 0U, 0U);

  return HAL_OK;
}

/**
  * @brief  Check if the smooth calibration is enabled.
  * @retval hal_rtc_calibration_status_t RTC smooth calibration status.
  */
hal_rtc_calibration_status_t HAL_RTC_IsEnabledCalibration(void)
{
  return (hal_rtc_calibration_status_t) LL_RTC_CAL_IsEnabledSmoothCalibration();
}

/**
  * @brief   Shift the RTC clock (Subsecond Register) by a fraction of a second.
  * @param   add_one_sec Choose between adding one second to the clock.
  * @param   fraction_sec_to_subtract Number of fraction of a second to subtract.
  * @note    the RTC calibration is write protected.
  *          Use the @ref HAL_RTC_DisableWriteProtection before calling this function.
  * @warning This feature is not compatible with the reference clock detection feature enabled
  *          by @ref HAL_RTC_CALENDAR_EnableReferenceClock
  * @warning This function will not decrease the number of seconds nor overflow the subsecond register.
  * @retval  HAL_OK
  * @retval  HAL_ERROR The shift operation is still pending after RTC timeout duration.
  *                    RTC_SHIFTR must not be written when the reference clock detection is enabled.
  *                    In BCD mode, SS[15] must be 0 before writing RTC_SHIFTR to avoid overflow.
  *                    In mixed mode, SUBFS[14:BCDU+8] must be written with 0.
  *                    In mixed mode, SS[BCDU+8] must be 0 before writing RTC_SHIFTR.
  */
hal_status_t HAL_RTC_ShiftCalibration(hal_rtc_calibration_shift_second_t add_one_sec,
                                      uint32_t fraction_sec_to_subtract)
{
  ASSERT_DBG_PARAM(IS_RTC_CALIBRATION_SHIFT_SECOND(add_one_sec));
  ASSERT_DBG_PARAM(IS_RTC_CALIBRATION_SHIFT_FRACTIONS(fraction_sec_to_subtract));
  uint32_t value_sec_tmp;
  hal_status_t status = HAL_OK;
  uint32_t binary_mode = LL_RTC_GetBinaryMode();

