MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  if (binary_mode == LL_RTC_BINARY_NONE)
  {
    /* Check if the 15th value of the subsecond register is equal to 0 or 1 in BCD mode */
    value_sec_tmp = LL_RTC_TIME_GetSubSecond();
    /* This is because of the shadow register */
    (void)LL_RTC_DATE_Get();

    if (((value_sec_tmp >> 15) & 1U) == 1U)
    {
      /* In BCD mode, SS[15] must be 0 before writing RTC_SHIFTR to avoid overflow. */
      status = HAL_ERROR;
    }
    if (LL_RTC_IsEnabledRefClock() == 1U)
    {
      /* RTC_SHIFTR must not be written when the reference clock detection is enabled. */
      status = HAL_ERROR;
    }
  }
  else if (binary_mode == LL_RTC_BINARY_MIX)
  {
    uint32_t bcd_increment = (LL_RTC_GetBinMixBCDU() >> LL_RTC_BINARY_MIX_BCDU_SHIFT) + 8U;

    if ((fraction_sec_to_subtract >> bcd_increment) != 0U)
    {
      /* In mixed mode, SUBFS[14:BCDU+8] must be written with 0. */
      status = HAL_ERROR;
    }

    value_sec_tmp = LL_RTC_TIME_GetSubSecond();
    /* This is because of the shadow register */
    (void)LL_RTC_DATE_Get();

    if (((value_sec_tmp >> bcd_increment) & 1U) == 1U)
    {
      /* In mixed mode, SS[BCDU+8] must be 0 before writing RTC_SHIFTR. */
      status = HAL_ERROR;
    }
  }
  else
  {
    /* In binary mode, no check */
  }

  if (status == HAL_OK)
  {
    /* Check that there is no shift ongoing */
    if (RTC_WaitSynchro_SHP() != HAL_OK)
    {
      return HAL_ERROR;
    }

    LL_RTC_TIME_Synchronize((uint32_t) add_one_sec, fraction_sec_to_subtract);

    if (RTC_WaitSynchro_SHP() != HAL_OK)
    {
      return HAL_ERROR;
    }

    if (RTC_WaitSynchro_RS() != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  return status;
}

/**
  * @}
  */

/** @addtogroup RTC_Exported_Functions_Alarms
  * @brief Exported alarm functions.
  * @{
  *
  * The RTC unit provides two programmable alarms. The alarms trigger when the calendar subseconds, seconds,
  * minutes, hours, day of month, or weekday match the values of the alarm.
  * Each field can be independently masked by setting @ref hal_rtc_alarm_date_time_t::mask.
  * When the alarm triggers, it can be automatically cleared by setting the parameter
  * @ref hal_rtc_alarm_config_t::auto_clear to @ref HAL_ALARM_AUTO_CLEAR_ENABLE.
  *
  * To update the alarms configuration, RTC must be in initialization mode or the
  * alarms must be disabled by using @ref HAL_RTC_EnterInitMode or @ref HAL_RTC_ALARM_Stop respectively.
  *
  * # Binary mode
  *
  * When using the binary mode only the subsecond registers are compared. A dedicated API is given
  * to optimize the code. The subseconds down-counter register can be reloaded every time the alarms triggers which
  * means that the subseconds down-counter register is running from 0xFFFF FFFF to the value set in the subseconds
  * registers of the alarm. This can only be used in binary mode.
  * This is configured by setting @ref hal_rtc_alarm_config_t::subsec_auto_reload to
  *  @ref ::HAL_RTC_ALARM_SUBSECONDS_AUTO_RELOAD_ENABLE.
  *
  */

/**
  * @brief  Configure the alarm parameters.
  * @param  alarm Select the alarm A or B.
  * @param  p_config_alarm Pointer to the alarm configuration instance.
  * @note   @ref hal_rtc_alarm_config_t::subsec_auto_reload can be enabled only in binary mode.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM when p_config_alarm is NULL.
  * @retval HAL_ERROR If the alarm is started and the RTC is not in initialization mode.
  *                   or if p_config_alarm->subsec_auto_reload is set to LL_RTC_ALMA_SUBSECONDBIN_AUTOCLR_YES
  *                   and RTC is in BCD or Mixed mode.
  */
hal_status_t HAL_RTC_ALARM_SetConfig(hal_rtc_alarm_t alarm, const hal_rtc_alarm_config_t *p_config_alarm)
{
  ASSERT_DBG_PARAM(p_config_alarm != NULL);
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));
  ASSERT_DBG_PARAM(IS_RTC_ALARM_BINARY_AUTO_RELOAD(p_config_alarm->subsec_auto_reload));
  ASSERT_DBG_PARAM(IS_RTC_ALARM_AUTO_CLEAR(p_config_alarm->auto_clear));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config_alarm == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if (LL_RTC_ALM_IsStarted((uint32_t)alarm) == 1U)
  {
    if (LL_RTC_IsActiveFlag_INIT() == 0U)
    {
      return HAL_ERROR;
    }
  }

  LL_RTC_ALM_SetBinAutoClr((uint32_t) alarm, (uint32_t) p_config_alarm->subsec_auto_reload);
  LL_RTC_ALM_SetFlagAutoClr((uint32_t) alarm, (uint32_t)p_config_alarm->auto_clear);

  return HAL_OK;
}

/**
  * @brief Retrieve the alarm configuration.
  * @param alarm Select the alarm A or B.
  * @param p_config_alarm Pointer to the alarm configuration instance.
  */
void HAL_RTC_ALARM_GetConfig(hal_rtc_alarm_t alarm, hal_rtc_alarm_config_t *p_config_alarm)
{
  ASSERT_DBG_PARAM(p_config_alarm != NULL);
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));

  p_config_alarm->subsec_auto_reload = (hal_rtc_alarm_subseconds_auto_reload_t)
                                       LL_RTC_ALM_GetBinAutoClr((uint32_t) alarm);
  p_config_alarm->auto_clear = (hal_rtc_alarm_auto_clear_t) LL_RTC_ALM_GetFlagAutoClr((uint32_t) alarm);
}

/**
  * @brief   Configure the alarm date and time.
  * @param   alarm Select the alarm A or B.
  * @param   p_date_time Pointer to the alarm date and time instance.
  * @warning The synchronous prescaler value, @ref hal_rtc_config_t::synch_prediv,
  *          must be greater than 3 when seconds are unmasked.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM when p_date_time is NULL.
  * @retval  HAL_ERROR if the alarm is started and the RTC is not in initialization mode.
  */
hal_status_t HAL_RTC_ALARM_SetDateTime(hal_rtc_alarm_t alarm, const hal_rtc_alarm_date_time_t *p_date_time)
{
  ASSERT_DBG_PARAM(p_date_time != NULL);
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));
  ASSERT_DBG_PARAM(IS_RTC_ALARM_MASK(p_date_time->mask));
  ASSERT_DBG_PARAM(IS_RTC_ALARM_DAY_TYPE(p_date_time->mday_wday_selection));
  ASSERT_DBG_PARAM(IS_RTC_WEEKDAY(p_date_time->wday_mday.wday) || IS_RTC_MONTHDAY_NBR(p_date_time->wday_mday.mday));
  ASSERT_DBG_PARAM(IS_RTC_TIME_FORMAT(p_date_time->time.am_pm));
  ASSERT_DBG_PARAM(IS_RTC_HOUR(p_date_time->time.hour, (hal_rtc_calendar_hour_format_t) LL_RTC_GetHourFormat()));
  ASSERT_DBG_PARAM(IS_RTC_MIN(p_date_time->time.min));
  ASSERT_DBG_PARAM(IS_RTC_SEC(p_date_time->time.sec));
  ASSERT_DBG_PARAM(IS_RTC_ALARM_SUBSECONDS(p_date_time->time.subsec));
  ASSERT_DBG_PARAM(IS_RTC_ALARM_SUBSECONDS_MASK(p_date_time->subsec_mask));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_date_time == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

