MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  uint32_t alarm_wday_mday;

  if (LL_RTC_ALM_IsStarted((uint32_t)alarm) == 1U)
  {
    if (LL_RTC_IsActiveFlag_INIT() == 0U)
    {
      return HAL_ERROR;
    }
  }

  if (p_date_time->mday_wday_selection == HAL_RTC_ALARM_DAY_TYPE_SEL_MONTHDAY)
  {
    alarm_wday_mday = p_date_time->wday_mday.mday;
  }
  else
  {
    alarm_wday_mday = (uint32_t) p_date_time->wday_mday.wday;
  }

  LL_RTC_ALM_SetConfigDateTime((uint32_t) alarm, p_date_time->mask,
                               (uint32_t) p_date_time->mday_wday_selection,
                               HAL_RTC_CONVERT_DEC2BCD(alarm_wday_mday),
                               (uint32_t) p_date_time->time.am_pm,
                               HAL_RTC_CONVERT_DEC2BCD(p_date_time->time.hour),
                               HAL_RTC_CONVERT_DEC2BCD(p_date_time->time.min),
                               HAL_RTC_CONVERT_DEC2BCD(p_date_time->time.sec));

  if (LL_RTC_GetBinaryMode() == LL_RTC_BINARY_MIX)
  {
    LL_RTC_ALM_SetBinarySubSecond((uint32_t) alarm, p_date_time->time.subsec);
    LL_RTC_ALM_SetSubSecondMask((uint32_t) alarm, p_date_time->subsec_mask);
  }
  else
  {
    LL_RTC_ALM_SetConfigSubSecond((uint32_t) alarm, p_date_time->subsec_mask,
                                  p_date_time->time.subsec);
  }


  return HAL_OK;
}

/**
  * @brief Retrieve the alarm date and time.
  * @param alarm Select the alarm A or B.
  * @param p_date_time Pointer to the alarm date and time instance.
  */
void HAL_RTC_ALARM_GetDateTime(hal_rtc_alarm_t alarm, hal_rtc_alarm_date_time_t *p_date_time)
{
  ASSERT_DBG_PARAM(p_date_time != NULL);
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));

  uint32_t alarm_register_value = LL_RTC_ALM_GetConfigDateTime((uint32_t)alarm);
  uint32_t alarm_day_wday_sel = LL_RTC_GET_ALARM_DAY_WDAY_SEL(alarm_register_value);
  uint32_t alarm_am_pm_value = LL_RTC_GET_ALARM_FORMAT(alarm_register_value);

  p_date_time->mask = LL_RTC_GET_ALARM_MASKS(alarm_register_value);
  p_date_time->mday_wday_selection = (hal_rtc_alarm_day_type_selection_t) alarm_day_wday_sel;

  uint32_t day_alarm_value = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_ALARM_DAY(alarm_register_value));

  if (p_date_time->mday_wday_selection == HAL_RTC_ALARM_DAY_TYPE_SEL_MONTHDAY)
  {
    p_date_time->wday_mday.mday = day_alarm_value;
  }
  else
  {
    p_date_time->wday_mday.wday = (hal_rtc_weekday_t) day_alarm_value;
  }

  p_date_time->time.am_pm = (hal_rtc_time_format_am_pm_t) alarm_am_pm_value;
  p_date_time->time.hour = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_ALARM_HOUR(alarm_register_value));
  p_date_time->time.min = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_ALARM_MINUTE(alarm_register_value));
  p_date_time->time.sec = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_ALARM_SECOND(alarm_register_value));

  uint32_t alarm_ss_register_value = LL_RTC_ALM_GetConfigSubSecond((uint32_t) alarm);

  if (LL_RTC_GetBinaryMode() == LL_RTC_BINARY_MIX)
  {
    p_date_time->time.subsec = LL_RTC_ALM_GetSubSecondMask((uint32_t) alarm);
  }
  else
  {
    p_date_time->time.subsec = LL_RTC_ALARM_GET_SS(alarm_ss_register_value);
  }

  p_date_time->subsec_mask = LL_RTC_ALARM_GET_MASK_SS(alarm_ss_register_value);
}

/**
  * @brief  Start the alarm.
  * @param  alarm Select the alarm A or B.
  * @param  interruption Enable the interrupt.
  *         @arg @ref HAL_RTC_ALARM_IT_DISABLE
  *         @arg @ref HAL_RTC_ALARM_IT_ENABLE
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_ALARM_Start(hal_rtc_alarm_t alarm, uint32_t interruption)
{
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));
  ASSERT_DBG_PARAM(IS_RTC_ALARM_IT(interruption));

  LL_RTC_ALM_Start((uint32_t) alarm, interruption);

  return HAL_OK;
}

/**
  * @brief  Stop the alarm.
  * @param  alarm Select the alarm A or B.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_ALARM_Stop(hal_rtc_alarm_t alarm)
{
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));

  LL_RTC_ALM_Stop((uint32_t) alarm);

  return HAL_OK;
}

/**
  * @brief  Poll for alarm event.
  * @param  alarm Select the alarm A or B.
  * @param  timeout_ms Timeout duration.
  * @retval HAL_OK
  * @retval HAL_TIMEOUT when reaching the timeout during polling.
  */
hal_status_t HAL_RTC_ALARM_PollForEvent(hal_rtc_alarm_t alarm, uint32_t timeout_ms)
{
  ASSERT_DBG_PARAM(IS_RTC_ALARM((uint32_t) alarm));

  uint32_t tickstart = HAL_GetTick();

  while (LL_RTC_IsActiveFlag_ALR((uint32_t) alarm) == 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        /* New check to avoid false timeout detection in case of preemption */
        if (LL_RTC_IsActiveFlag_ALR((uint32_t) alarm) == 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  LL_RTC_ClearFlag_ALR((uint32_t) alarm);

  return HAL_OK;
}

/**
  * @brief  Program the alarm subseconds.
  * @param  alarm Select the alarm A or B.
  * @param  alarm_subsecond Alarm subsecond value. Value between 0x0 and 0xFFFFFFFF.
  * @note   Use in binary mode only. Prefer @ref HAL_RTC_ALARM_SetDateTime to program the alarm in BCD or mixed mode.
  * @retval HAL_OK
  * @retval HAL_ERROR
  */
hal_status_t HAL_RTC_ALARM_SetBinaryTime(hal_rtc_alarm_t alarm, uint32_t alarm_subsecond)
{
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));

  if (LL_RTC_ALM_IsStarted((uint32_t)alarm) == 1U)
  {
    if (LL_RTC_IsActiveFlag_INIT() == 0U)
    {
      return HAL_ERROR;
    }
  }

  LL_RTC_ALM_SetBinarySubSecond((uint32_t) alarm, alarm_subsecond);

  return HAL_OK;
}

/**
  * @brief  Retrieve the alarm subseconds.
  * @param  alarm Select the alarm A or B.
  * @note   Use in binary mode only. Prefer @ref HAL_RTC_ALARM_GetDateTime to
  *         retrieve alarm subseconds in BCD or mixed mode.
  * @retval uint32_t Alarm subseconds.
  */
uint32_t HAL_RTC_ALARM_GetBinaryTime(hal_rtc_alarm_t alarm)
{
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));

  return LL_RTC_ALM_GetBinarySubSecond((uint32_t) alarm);
}

/**
  * @brief  Program the alarm subseconds mask.
  * @param  alarm Select the alarm A or B.
  * @param  alarm_subsecond_mask Alarm subsecond mask. Value between 0x0 and 0x3F.
  * @note   Use in binary mode only. Prefer @ref HAL_RTC_ALARM_SetDateTime to program the alarm in BCD or mixed mode.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_ALARM_SetBinarySubSecondMask(hal_rtc_alarm_t alarm, uint32_t alarm_subsecond_mask)
{
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));
  ASSERT_DBG_PARAM(IS_RTC_ALARM_SUBSECONDS_MASK(alarm_subsecond_mask));

