MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  if (LL_RTC_ALM_IsStarted((uint32_t)alarm) == 1U)
  {
    if (LL_RTC_IsActiveFlag_INIT() == 0U)
    {
      return HAL_ERROR;
    }
  }

  LL_RTC_ALM_SetSubSecondMask((uint32_t) alarm, alarm_subsecond_mask);

  return HAL_OK;
}

/**
  * @brief  Retrieve the alarm subseconds mask.
  * @param  alarm Select the alarm A or B.
  * @note   Use in binary mode only. Prefer @ref HAL_RTC_ALARM_GetDateTime to
  *         retrieve alarm subseconds mask in BCD or mixed mode.
  * @retval uint32_t Alarm subseconds mask.
  */
uint32_t HAL_RTC_ALARM_GetBinarySubSecondMask(hal_rtc_alarm_t alarm)
{
  ASSERT_DBG_PARAM(IS_RTC_ALARM(alarm));

  return LL_RTC_ALM_GetSubSecondMask((uint32_t) alarm);
}

/**
  * @}
  */

/** @addtogroup RTC_Exported_Functions_Timestamp
  * @brief Exported timestamp functions.
  * @{
  *
  * Timestamp is enabled by setting the TSE bit of RTC_CR register to 1.
  * When TSE is set, the calendar is saved in the timestamp registers (RTC_TSSSR, RTC_TSTR, RTC_TSDR)
  * when a timestamp event is detected on the RTC_TS pin.
  *
  * When TAMPTS is set:
  * The calendar is saved in the timestamp registers (RTC_TSSSR, RTC_TSTR, RTC_TSDR)
  * when an internal or external tamper event is detected.
  *
  * After a timestamp event, by calling the @ref HAL_RTC_TIMESTAMP_GetDateTime, the application
  * can retrieve the date and time of the last timestamp event and clear the timestamp registers.
  *
  */

/**
  * @brief  Configure the RTC timestamp.
  * @param  p_config_timestamp pointer to an RTC timestamp configuration instance.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM when p_config_timestamp is NULL.
  */
hal_status_t HAL_RTC_TIMESTAMP_SetConfig(const hal_rtc_timestamp_config_t *p_config_timestamp)
{
  ASSERT_DBG_PARAM(p_config_timestamp != NULL);
  ASSERT_DBG_PARAM(IS_RTC_TIMESTAMP_SOURCE_PIN_EDGE(p_config_timestamp->input_edge_polarity));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config_timestamp == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_RTC_TS_SetActiveEdge((uint32_t) p_config_timestamp->input_edge_polarity);

  return HAL_OK;
}

/**
  * @brief Retrieve the RTC timestamp configuration.
  * @param p_config_timestamp pointer to an RTC timestamp configuration instance.
  */
void HAL_RTC_TIMESTAMP_GetConfig(hal_rtc_timestamp_config_t *p_config_timestamp)
{
  ASSERT_DBG_PARAM(p_config_timestamp != NULL);

  p_config_timestamp->input_edge_polarity = (hal_rtc_timestamp_source_pin_edge_t) LL_RTC_TS_GetActiveEdge();
}

/**
  * @brief  Enable the RTC timestamp from the external pin (RTC_TS).
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_TIMESTAMP_EnablePinSource(void)
{
  LL_RTC_TS_Enable();

  return HAL_OK;
}

/**
  * @brief  Disable the RTC timestamp from the external pin (RTC_TS).
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_TIMESTAMP_DisablePinSource(void)
{
  LL_RTC_TS_Disable();

  return HAL_OK;
}

/**
  * @brief  Check if the RTC timestamps from the external pin (RTC_TS) is enabled.
  * @retval hal_rtc_timestamp_status_t RTC timestamp from the external pin status.
  */
hal_rtc_timestamp_status_t HAL_RTC_TIMESTAMP_IsEnabledPinSource(void)
{
  return (hal_rtc_timestamp_status_t) LL_RTC_TS_IsEnabled();
}


/**
  * @brief  Enable the RTC timestamp on tamper event.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_TIMESTAMP_EnableTamperSource(void)
{
  LL_RTC_TS_EnableOnTamper();

  return HAL_OK;
}

/**
  * @brief  Disable the RTC timestamp on tamper event.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_TIMESTAMP_DisableTamperSource(void)
{
  LL_RTC_TS_DisableOnTamper();

  return HAL_OK;
}

/**
  * @brief  Check whether the RTC timestamp on tamper event is enabled.
  * @retval hal_rtc_timestamp_tamper_status_t RTC timestamp on tamper event status.
  */
hal_rtc_timestamp_tamper_status_t HAL_RTC_TIMESTAMP_IsEnabledTamperSource(void)
{
  return (hal_rtc_timestamp_tamper_status_t) LL_RTC_TS_IsEnabledOnTamper();
}

/**
  * @brief  Enable the RTC timestamp interrupt.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_TIMESTAMP_EnableIT(void)
{
  LL_RTC_EnableIT_TS();

  return HAL_OK;
}

/**
  * @brief  Disable the RTC timestamp interrupt.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_TIMESTAMP_DisableIT(void)
{
  LL_RTC_DisableIT_TS();

  return HAL_OK;
}

/**
  * @brief  Check if the RTC timestamp interrupt is enabled.
  * @retval hal_rtc_timestamp_it_status_t RTC timestamp interrupt status.
  */
hal_rtc_timestamp_it_status_t HAL_RTC_TIMESTAMP_IsEnabledIT(void)
{
  return (hal_rtc_timestamp_it_status_t) LL_RTC_IsEnabledIT_TS();
}

/**
  * @brief  Retrieve the RTC timestamp time and the source of the timestamp event.
  *         Due to register limitations, the year is forced to 0 when reading the timestamp.
  * @param  p_time pointer to an RTC timestamp time instance.
  * @param  p_date pointer to an RTC timestamp date instance.
  * @param  p_info pointer to a @ref hal_rtc_timestamp_information_t value.
  *         It is used to retrieve the flag of the timestamp event.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM when p_date or p_time are NULL.
  * @retval HAL_ERROR When an overflow occurred
  */
hal_status_t HAL_RTC_TIMESTAMP_GetDateTime(hal_rtc_time_t *p_time, hal_rtc_date_t *p_date,
                                           hal_rtc_timestamp_information_t *p_info)
{
  ASSERT_DBG_PARAM(p_time != NULL);
  ASSERT_DBG_PARAM(p_date != NULL);
  ASSERT_DBG_PARAM(p_info != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_date == NULL) || (p_time == NULL) || (p_info == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  uint32_t time_and_format = LL_RTC_TS_GetTimeAndFormat();
  uint32_t format = LL_RTC_GET_FORMAT(time_and_format);
  uint32_t date = LL_RTC_TS_GetDate();
  uint32_t week_day = LL_RTC_GET_WEEKDAY(date);
  uint32_t month = LL_RTC_GET_MONTH(date);
  hal_status_t status = HAL_OK;

  /* Get timestamp time information */
  p_time->am_pm = (hal_rtc_time_format_am_pm_t) format;
  p_time->hour = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_HOUR(time_and_format));
  p_time->min = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_MINUTE(time_and_format));
  p_time->sec = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_SECOND(time_and_format));
  p_time->subsec = LL_RTC_TS_GetSubSecond();

