MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  /* Get timestamp date information */
  p_date->mon = (hal_rtc_month_t) month;
  p_date->wday = (hal_rtc_weekday_t) week_day;
  p_date->mday = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_DAY(date));
  p_date->year = 0U;

  p_info->flag = (hal_rtc_timestamp_event_flag_t)((uint32_t)(LL_RTC_READ_REG(SR) & (LL_RTC_SR_TSF | LL_RTC_SR_TSOVF)));

  if (((uint32_t)p_info->flag & (uint32_t)HAL_RTC_TIMESTAMP_EVENT) == (uint32_t)HAL_RTC_TIMESTAMP_EVENT)
  {
    /* It is recommended to check and then clear TSOVF only after clearing the TSF bit */
    LL_RTC_ClearFlag_TS();

    if (LL_RTC_IsActiveFlag_TSOV() != 0U)
    {
      p_info->flag = (hal_rtc_timestamp_event_flag_t)((uint32_t)((uint32_t)p_info->flag \
                                                                 | (uint32_t)(HAL_RTC_TIMESTAMP_OVERFLOW_EVENT)));
      status = HAL_ERROR;
    }
  }

  /* Clear all timestamp flags */
  LL_RTC_WRITE_REG(SCR, LL_RTC_SCR_TSF | LL_RTC_SCR_TSOVF);

  return status;
}

/**
  * @brief Poll for timestamp event.
  * @param timeout_ms Timeout duration
  * @retval HAL_OK
  * @retval HAL_TIMEOUT when the timeout is reached.
  */
hal_status_t HAL_RTC_TIMESTAMP_PollForEvent(uint32_t timeout_ms)
{
  uint32_t tickstart = HAL_GetTick();

  while (LL_RTC_IsActiveFlag_TS() == 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        /* New check to avoid false timeout detection in case of preemption */
        if (LL_RTC_IsActiveFlag_TS() == 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Retrieve the RTC timestamp subsecond register value.
  * @param  p_time_subseconds pointer to a uint32_t to retrieve the value of the subseconds of the timestamp.
  * @param  p_info pointer to a @ref hal_rtc_timestamp_information_t value.
  *         It is used to retrieve the flag of the timestamp event.
  * @retval HAL_OK
  * @retval HAL_ERROR If an overflow occurred
  */
hal_status_t HAL_RTC_TIMESTAMP_GetBinaryTime(uint32_t *p_time_subseconds, hal_rtc_timestamp_information_t *p_info)
{
  ASSERT_DBG_PARAM(p_time_subseconds != NULL);
  ASSERT_DBG_PARAM(p_info != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_time_subseconds == NULL) || (p_info == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hal_status_t status = HAL_OK;

  /* Get timestamp subseconds */
  *p_time_subseconds = LL_RTC_TS_GetSubSecond();

  p_info->flag = (hal_rtc_timestamp_event_flag_t)((uint32_t)(LL_RTC_READ_REG(SR) & (LL_RTC_SR_TSF | LL_RTC_SR_TSOVF)));

  if (((uint32_t)p_info->flag & (uint32_t)HAL_RTC_TIMESTAMP_EVENT) == (uint32_t)HAL_RTC_TIMESTAMP_EVENT)
  {
    /* It is recommended to check and then clear TSOVF only after clearing the TSF bit */
    LL_RTC_ClearFlag_TS();

    if (LL_RTC_IsActiveFlag_TSOV() != 0U)
    {
      p_info->flag = (hal_rtc_timestamp_event_flag_t)((uint32_t)((uint32_t)p_info->flag \
                                                                 | (uint32_t)(HAL_RTC_TIMESTAMP_OVERFLOW_EVENT)));
      status = HAL_ERROR;
    }
  }

  /* Clear all timestamp flags */
  LL_RTC_WRITE_REG(SCR, LL_RTC_SCR_TSF | LL_RTC_SCR_TSOVF);

  return status;
}

/**
  * @}
  */

/** @addtogroup RTC_Exported_Functions_WakeUp_Timer
  * @brief Exported wake-up timer functions.
  * @{
  *
  * The wake-up timer is a 16-bit auto-reload down-counter. The wake-up timer clock input can be one of:
  * * The RTCCLK divided by a dedicated prescaler of 2, 4, 8, or 16.
  * * The synchronous clock that is configured by changing the values of the RTC
  *   prescalers @ref hal_rtc_config_t::asynch_prediv and @ref hal_rtc_config_t::synch_prediv.
  *
  * Call @ref HAL_RTC_WAKEUP_SetConfig and configure @ref hal_rtc_wakeup_config_t::clock
  * to choose the input clock of the wake-up timer. When using the synchronous clock
  * input, the wake-up timer can behave like a 17-bit auto-reload down-counter by
  * setting the value @ref ::HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE_ADD_1BIT to
  * @ref hal_rtc_wakeup_config_t::clock. In this case, the 16-bit down-counter
  * reaches 0 two times; the first time it reloads automatically but triggers a
  * wake-up event. The second time it does not reload automatically but also
  * triggers a wake-up event.
  *
  * By setting the parameter p_auto_clear_time to a non-zero value in function
  * @ref HAL_RTC_WAKEUP_SetPeriod, the wake-up timer flag is cleared by hardware
  * when the auto-reload down-counter reaches this value.
  *
  * To configure the wake-up timer without using physical time units, call
  * @ref HAL_RTC_WAKEUP_SetAutoReloadAndAutoClear.
  */

/**
  * @brief  Configure the RTC wake-up timer.
  * @param  p_config_wakeup_timer Pointer to an RTC wake-up timer configuration instance.
  * @retval HAL_OK
  * @retval HAL_ERROR If not in initialization mode and wake-up timer is started.
  *                   If not in initialization mode and WUTWF is still unset after RTC timeout duration.
  * @retval HAL_INVALID_PARAM When p_config_wakeup_timer is NULL.
  */
hal_status_t HAL_RTC_WAKEUP_SetConfig(const hal_rtc_wakeup_config_t *p_config_wakeup_timer)
{
  ASSERT_DBG_PARAM(p_config_wakeup_timer != NULL);
  ASSERT_DBG_PARAM(IS_RTC_WAKEUP_TIMER_CLOCK(p_config_wakeup_timer->clock));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config_wakeup_timer == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hal_status_t synchro_status = RTC_WaitSynchro_WUTW();

  if (synchro_status != HAL_OK)
  {
    return synchro_status;
  }

  LL_RTC_WAKEUP_SetClock((uint32_t) p_config_wakeup_timer->clock);

  return HAL_OK;
}

/**
  * @brief Retrieve the configuration of the RTC wake-up timer.
  * @param p_config_wakeup_timer Pointer to an RTC wake-up timer configuration instance.
  */
void HAL_RTC_WAKEUP_GetConfig(hal_rtc_wakeup_config_t *p_config_wakeup_timer)
{
  ASSERT_DBG_PARAM(p_config_wakeup_timer != NULL);

  p_config_wakeup_timer->clock = (hal_rtc_wakeup_timer_clock_t) LL_RTC_WAKEUP_GetClock();
}

/**
  * @brief  Program the RTC wake-up timer auto-reload time and auto-reload clear flag time.
  * @param  p_auto_reload_time Pointer to an RTC time instance representing the wake-up reload period.
  * @param  p_auto_clear_time Pointer to an RTC time instance representing the wake-up auto-clear flag time.
  * @note   @ref hal_rtc_time_t::am_pm field is ignored because it is not used in the SetPeriod function.
  * @note   @ref hal_rtc_time_t::subsec field is ignored because it is not used in the SetPeriod function.
  * @retval HAL_OK
  * @retval HAL_ERROR The wake-up timer is still in use.
  *                   The wake-up timer frequency is smaller than 1 Hz;
  *                   use @ref HAL_RTC_WAKEUP_SetAutoReloadAndAutoClear.
  *                   Auto-reload time is shorter than auto-reload clear flag time.
  *                   The value of the auto-reload time is too big or too small or the wake-up timer counter.
  *                   The wake-up write flag is still cleared after timeout.
  * @retval HAL_INVALID_PARAM p_period is NULL.
  */
hal_status_t HAL_RTC_WAKEUP_SetPeriod(const hal_rtc_time_t *p_auto_reload_time, const hal_rtc_time_t *p_auto_clear_time)
{
  ASSERT_DBG_PARAM(p_auto_reload_time != NULL);
  ASSERT_DBG_PARAM(p_auto_clear_time != NULL);
  ASSERT_DBG_PARAM(IS_RTC_HOUR_36(p_auto_reload_time->hour));
  ASSERT_DBG_PARAM(IS_RTC_MIN(p_auto_reload_time->min));
  ASSERT_DBG_PARAM(IS_RTC_SEC(p_auto_reload_time->sec));
  ASSERT_DBG_PARAM(IS_RTC_MICROSEC(p_auto_reload_time->microsec));
  ASSERT_DBG_PARAM(IS_RTC_MILLISEC(p_auto_reload_time->millisec));

  ASSERT_DBG_PARAM(IS_RTC_HOUR_36(p_auto_clear_time->hour));
  ASSERT_DBG_PARAM(IS_RTC_MIN(p_auto_clear_time->min));
  ASSERT_DBG_PARAM(IS_RTC_SEC(p_auto_clear_time->sec));
  ASSERT_DBG_PARAM(IS_RTC_MICROSEC(p_auto_clear_time->microsec));
  ASSERT_DBG_PARAM(IS_RTC_MILLISEC(p_auto_clear_time->millisec));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_auto_reload_time == NULL) || (p_auto_clear_time == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

