MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  hal_status_t status;
  uint32_t seconds_auto_reload;
  uint32_t seconds_auto_clear;
  uint32_t microseconds_auto_reload;
  uint32_t microseconds_auto_clear;
  uint32_t frequency_wakeup;
  uint32_t bits_wakeup;
  uint32_t bits_auto_clear;
  uint32_t max_seconds;
  uint32_t min_seconds;
  hal_rtc_wakeup_timer_clock_t clock_prescaler_wakeup;

  if (LL_RTC_WAKEUP_IsEnabled() == 1U)
  {
    return HAL_ERROR;
  }

  seconds_auto_reload = (p_auto_reload_time->hour * RTC_HOUR_SECONDS) +
                        (p_auto_reload_time->min * RTC_MIN_SECONDS) +
                        (p_auto_reload_time->sec);
  seconds_auto_clear = (p_auto_clear_time->hour * RTC_HOUR_SECONDS) +
                       (p_auto_clear_time->min * RTC_MIN_SECONDS) +
                       (p_auto_clear_time->sec);

  microseconds_auto_reload = (p_auto_reload_time->microsec) +
                             (p_auto_reload_time->millisec * RTC_MILLIMICROSECONDS);

  microseconds_auto_clear = (p_auto_clear_time->microsec) +
                            (p_auto_clear_time->millisec * RTC_MILLIMICROSECONDS);

  /* We verify that the flag auto clear time is smaller than the auto-reload time */
  if ((seconds_auto_clear > seconds_auto_reload)
      || ((seconds_auto_clear == seconds_auto_reload) && (microseconds_auto_reload < microseconds_auto_clear)))
  {
    return HAL_ERROR;
  }

  /* Get the frequency of the wake-up timer clock to perform seconds/microsecond conversion into bits */
  clock_prescaler_wakeup = (hal_rtc_wakeup_timer_clock_t) LL_RTC_WAKEUP_GetClock();
  frequency_wakeup = RTC_GetWakeUpClockFrequency(clock_prescaler_wakeup);

  /* Frequency slower than 1Hz triggers an error */
  if (frequency_wakeup == 0U)
  {
    return HAL_ERROR;
  }

  /* We check that we do not overflow the values. We only check the reload time because
  we checked that the flag_auto_clear time is smaller than the reload time */
  if (clock_prescaler_wakeup == HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE_ADD_1BIT)
  {
    max_seconds = RTC_MAX_WAKEUP_VALUE_17BITS / frequency_wakeup;
    min_seconds = RTC_MIN_WAKEUP_VALUE_17BITS / frequency_wakeup;
  }
  else
  {
    min_seconds = RTC_MIN_WAKEUP_VALUE_16BITS / frequency_wakeup;
    max_seconds = RTC_MAX_WAKEUP_VALUE_16BITS / frequency_wakeup;
  }

  if ((seconds_auto_reload >= max_seconds) || (seconds_auto_reload <= min_seconds))
  {
    return HAL_ERROR;
  }

  bits_wakeup = RTC_ConvertSecSubsecToBits(seconds_auto_reload,
                                           p_auto_reload_time->millisec,
                                           p_auto_reload_time->microsec,
                                           frequency_wakeup);
  bits_auto_clear = RTC_ConvertSecSubsecToBits(seconds_auto_clear,
                                               p_auto_clear_time->millisec,
                                               p_auto_clear_time->microsec,
                                               frequency_wakeup);
  status = RTC_WaitSynchro_WUTW();
  if (status != HAL_OK)
  {
    return status;
  }

  LL_RTC_WAKEUP_Config(bits_wakeup, bits_auto_clear);

  return HAL_OK;
}

/**
  * @brief Retrieve the RTC wake-up timer auto-reload and auto-reload clear value.
  * @param p_auto_reload_time pointer to an RTC time instance representing the wake-up reload period.
  * @param p_auto_clear_time pointer to an RTC time instance representing the wake-up auto-clear flag time.
  */
void HAL_RTC_WAKEUP_GetPeriod(hal_rtc_time_t *p_auto_reload_time, hal_rtc_time_t *p_auto_clear_time)
{
  ASSERT_DBG_PARAM(p_auto_reload_time != NULL);
  ASSERT_DBG_PARAM(p_auto_clear_time != NULL);

  uint32_t bits_auto_reload;
  uint32_t bits_flag_auto_clear;
  uint32_t frequency_wakeup;
  uint32_t value_reg_wakeup;
  hal_rtc_wakeup_timer_clock_t clock_prescaler_wakeup;

  clock_prescaler_wakeup = (hal_rtc_wakeup_timer_clock_t) LL_RTC_WAKEUP_GetClock();
  frequency_wakeup = RTC_GetWakeUpClockFrequency(clock_prescaler_wakeup);

  /* When the wake-up clock selection is set to HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE_ADD_1BIT, add one bit to the value
    of the wake-up auto-reload time from the RTC_WUTR register */

  value_reg_wakeup = LL_RTC_READ_REG(WUTR);

  bits_auto_reload = LL_RTC_GET_WAKEUP_AUTORELOAD(value_reg_wakeup);
  bits_flag_auto_clear = LL_RTC_GET_WAKEUP_AUTOCLEAR(value_reg_wakeup);

  if (clock_prescaler_wakeup == HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE_ADD_1BIT)
  {
    bits_auto_reload += RTC_WAKEUP_TIMER_CLOCK_SECONDS_ADD_1BIT;
    bits_flag_auto_clear += RTC_WAKEUP_TIMER_CLOCK_SECONDS_ADD_1BIT;
  }

  RTC_ConvertBitsToTime(p_auto_reload_time, bits_auto_reload, frequency_wakeup);
  RTC_ConvertBitsToTime(p_auto_clear_time, bits_flag_auto_clear, frequency_wakeup);
}

/**
  * @brief  Start the wake-up timer.
  * @param  interruption Specifies the wake-up timer mode.
  *         @arg @ref HAL_RTC_WAKEUP_IT_DISABLE
  *         @arg @ref HAL_RTC_WAKEUP_IT_ENABLE
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_WAKEUP_Start(uint32_t interruption)
{
  ASSERT_DBG_PARAM(IS_RTC_WAKEUP_IT(interruption));
  LL_RTC_WAKEUP_Start(interruption);

  return HAL_OK;
}

/**
  * @brief Stops the wake-up timer.
  * @retval HAL_OK
  */
hal_status_t HAL_RTC_WAKEUP_Stop(void)
{
  LL_RTC_WAKEUP_Stop();

  return HAL_OK;
}

/**
  * @brief  Poll for wake-up timer event.
  * @param  timeout_ms Timeout duration.
  * @retval HAL_OK
  * @retval HAL_TIMEOUT If WUTF is unset after timeout duration.
  */
hal_status_t HAL_RTC_WAKEUP_PollForEvent(uint32_t timeout_ms)
{
  uint32_t tickstart = HAL_GetTick();

  while (LL_RTC_IsActiveFlag_WUT() == 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        /* New check to avoid false timeout detection in case of preemption */
        if (LL_RTC_IsActiveFlag_WUT() == 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  LL_RTC_ClearFlag_WUT();

  return HAL_OK;
}

/**
  * @brief  Program the RTC wake-up timer auto-reload and auto-reload clear value in binary.
  * @param  wakeup_timer_auto_reload Wake-up timer auto-reload time in binary
  * @param  wakeup_timer_auto_clear Wake-up timer auto-reload clear value in binary
  * @retval HAL_OK
  * @retval HAL_ERROR If WUTF is unset after timeout duration.
  */
hal_status_t HAL_RTC_WAKEUP_SetAutoReloadAndAutoClear(uint32_t wakeup_timer_auto_reload,
                                                      uint32_t wakeup_timer_auto_clear)
{
  ASSERT_DBG_PARAM(IS_RTC_WAKEUP_VALUE(wakeup_timer_auto_reload));
  ASSERT_DBG_PARAM(IS_RTC_WAKEUP_AUTOCLEAR_VALUE(wakeup_timer_auto_clear));
  ASSERT_DBG_PARAM(IS_RTC_WAKEUP_AUTORELOAD_AUTOCLEAR(wakeup_timer_auto_reload, wakeup_timer_auto_clear));

  hal_status_t status = RTC_WaitSynchro_WUTW();

  if (status != HAL_OK)
  {
    return status;
  }

  LL_RTC_WAKEUP_Config(wakeup_timer_auto_reload, wakeup_timer_auto_clear);

  return HAL_OK;
}

/**
  * @brief  Retrieve the wake-up timer auto-reload value.
  * @retval uint32_t Auto-reload value
  */
uint32_t HAL_RTC_WAKEUP_GetAutoReload(void)
{
  return LL_RTC_WAKEUP_GetAutoReload();
}

/**
  * @brief  Retrieve wake-up timer auto-reload output clear value.
  * @retval uint32_t Auto-reload output clear value.
  */
uint32_t HAL_RTC_WAKEUP_GetAutoClear(void)
{
  return LL_RTC_WAKEUP_GetAutoClear();
}

/**
  * @}
  */
/** @addtogroup RTC_Exported_Functions_IRQ
  * @brief IRQ handler exported functions.
  * @{
  *
  * IRQ handler functions to manage the different interrupts:
  * * Alarm A and alarm B
  * * Timestamps
  * * Wake-up timer
  * * Subsecond register underflow in binary mode.
  */

/**
  * @brief Handle RTC interrupt request.
  */
void HAL_RTC_IRQHandler(void)
{
  uint32_t flags = LL_RTC_READ_REG(SR);

  if (LL_RTC_ALARM_A_GET_FLAG(flags) != 0U)
  {
    LL_RTC_ClearFlag_ALRA();
    HAL_RTC_AlarmAEventCallback();
  }

  if (LL_RTC_ALARM_B_GET_FLAG(flags) != 0U)
  {
    LL_RTC_ClearFlag_ALRB();
    HAL_RTC_AlarmBEventCallback();
  }

  if (LL_RTC_WAKEUP_GET_FLAG(flags) != 0U)
  {
    LL_RTC_ClearFlag_WUT();
    HAL_RTC_WakeUpTimerEventCallback();
  }

  if (LL_RTC_SSRU_GET_FLAG(flags) != 0U)
  {
    LL_RTC_ClearFlag_SSRU();
    HAL_RTC_SubSecondsUnderflowEventCallback();
  }

