MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  if (LL_RTC_TIMESTAMP_GET_FLAG(flags) != 0U)
  {
    HAL_RTC_TimestampEventCallback();
  }
}

/**
  * @brief Handle alarm interrupt request.
  */
void HAL_RTC_ALARM_IRQHandler(void)
{
  uint32_t flags = LL_RTC_READ_REG(SR);

  if (LL_RTC_ALARM_A_GET_FLAG(flags) != 0U)
  {
    /* Clear the alarm A interrupt pending bit */
    LL_RTC_ClearFlag_ALRA();
    HAL_RTC_AlarmAEventCallback();

  }
  if ((LL_RTC_ALARM_B_GET_FLAG(flags)) != 0U)
  {
    /* Clear the alarm B interrupt pending bit */
    LL_RTC_ClearFlag_ALRB();
    HAL_RTC_AlarmBEventCallback();
  }
}

/**
  * @brief Handle timestamp request.
  * @note  Inside the callback, call @ref HAL_RTC_TIMESTAMP_GetDateTime
  *        to clear the different timestamp flags (TSF, TSOVF).
  */
void HAL_RTC_TIMESTAMP_IRQHandler(void)
{
  if (LL_RTC_IsActiveFlag_TS() != 0U)
  {
    HAL_RTC_TimestampEventCallback();
  }
}

/**
  * @brief Handle wake-up timer interrupt request.
  */
void HAL_RTC_WAKEUP_IRQHandler(void)
{
  if (LL_RTC_IsActiveFlag_WUT() != 0U)
  {
    LL_RTC_ClearFlag_WUT();
    HAL_RTC_WakeUpTimerEventCallback();
  }
}

/**
  * @brief Handle subsecond register underflow interrupt request.
  */
void HAL_RTC_SubSecondsUnderflow_IRQHandler(void)
{
  /* Get the pending status of the SSR Underflow Interrupt */
  if (LL_RTC_IsActiveFlag_SSRU() != 0U)
  {
    /* Immediately clear SSR underflow flag */
    LL_RTC_ClearFlag_SSRU();

    /* SSRU callback */
    HAL_RTC_SubSecondsUnderflowEventCallback();
  }
}

/**
  * @}
  */

/** @addtogroup RTC_Exported_Functions_Callback
  * @brief Exported callback functions.
  * @{
  *  Callback functions that can be overwritten for the different interrupts:
  * * Alarm A
  * * Alarm B
  * * Wake-up timer
  * * Timestamp
  * * Subsecond register underflow only in binary mode.
  *
  * When rewriting the timestamp callback function, @ref HAL_RTC_TimestampEventCallback,
  * call @ref HAL_RTC_TIMESTAMP_GetDateTime or @ref HAL_RTC_TIMESTAMP_GetBinaryTime to clear
  * the timestamp flags (TSF, TSOVF).
  */

/**
  * @brief Alarm A callback.
  */
__WEAK void HAL_RTC_AlarmAEventCallback(void)
{
  /* NOTE: This function must not be modified in this file. When the callback is needed,
   HAL_RTC_AlarmAEventCallback() can be implemented in the application file. */
}

/**
  * @brief Alarm B callback.
  */
__WEAK void HAL_RTC_AlarmBEventCallback(void)
{
  /* NOTE: This function must not be modified in this file. When the callback is needed,
   HAL_RTC_AlarmBEventCallback() can be implemented in the application file. */
}

/**
  * @brief Timestamp callback.
  * @note  When rewriting this function, call @ref HAL_RTC_TIMESTAMP_GetDateTime or
  *        @ref HAL_RTC_TIMESTAMP_GetBinaryTime to clear the different timestamp flags.
  */
__WEAK void HAL_RTC_TimestampEventCallback(void)
{
  /* NOTE: This function must not be modified in this file. When the callback is needed,
   HAL_RTC_TimestampEventCallback() can be implemented in the application file. */
}

/**
  * @brief Wake-up timer callback.
  */
__WEAK void HAL_RTC_WakeUpTimerEventCallback(void)
{
  /* NOTE: This function must not be modified in this file. When the callback is needed,
   HAL_RTC_WakeUpTimerEventCallback() can be implemented in the application file. */
}

/**
  * @brief SSRU callback.
  */
__WEAK void HAL_RTC_SubSecondsUnderflowEventCallback(void)
{
  /* NOTE: This function must not be modified in this file. When the callback is needed,
   HAL_RTC_SubSecondsUnderflowEventCallback() can be implemented in the application file. */
}
/**
  * @}
  */

/** @addtogroup RTC_Exported_Functions_Attributes
  * @brief This section provides functions for managing security, privilege and lock configurations
  * @{
  * - Call HAL_RTC_SetPrivAttr() to set the privilege attribute of specified RTC item(s).
  * - Call HAL_RTC_GetPrivAttr() to get the privilege attribute state of specified RTC item.
  */

/**
  * @brief  Set RTC item(s) privilege configuration.
  * @param  item This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_RTC_PRIV_ITEM_ALRAPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_ALRBPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_WUTPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_TSPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_CALPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_INITPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_PRIV
  * @param priv_attr This parameter is an element of @ref hal_rtc_priv_attr_t enumeration.
  * @retval HAL_ERROR Non-Privileged write to a privilege-only register.
  * @retval HAL_OK    Privilege has been correctly configured.
  */
hal_status_t HAL_RTC_SetPrivAttr(uint32_t item, hal_rtc_priv_attr_t priv_attr)
{
  ASSERT_DBG_PARAM(IS_RTC_PRIV_SET_ITEM(item));
  ASSERT_DBG_PARAM(IS_RTC_ITEM_PRIV_ATTR(priv_attr));

  if (STM32_IS_PRIVILEGED_EXECUTION() == 0U)
  {
    return HAL_ERROR;
  }

  LL_RTC_SetPrivAttr(item, (uint32_t)priv_attr);

  return HAL_OK;
}

/**
  * @brief  Get RTC item privilege configuration.
  * @param  item This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_RTC_PRIV_ITEM_ALRAPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_ALRBPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_WUTPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_TSPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_CALPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_INITPRIV
  *         @arg @ref HAL_RTC_PRIV_ITEM_PRIV
  * @retval Returned value is an element of @ref hal_rtc_priv_attr_t enumeration.
  */
hal_rtc_priv_attr_t HAL_RTC_GetPrivAttr(uint32_t item)
{
  ASSERT_DBG_PARAM(IS_RTC_PRIV_GET_ITEM(item));

  return (hal_rtc_priv_attr_t)LL_RTC_GetPrivAttr(item);
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup RTC_Private_Functions RTC private functions
  * @brief RTC private functions.
  * @{
  */

/**
  * @brief  Wait until the RTC Time and Date registers (RTC_TR and RTC_DR) are
  *         synchronized with RTC APB clock.
  * @retval HAL_OK
  * @retval HAL_ERROR If resynchronization flag is still unset after RTC timeout duration.
  */
static hal_status_t RTC_WaitSynchro_RS(void)
{
  uint32_t tickstart;

