MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rtc.c
  if (LL_RTC_IsEnabledBypassShadowReg() == 0U)
  {
    if (LL_RTC_IsActiveFlag_INIT() == 0U)
    {
      LL_RTC_ClearFlag_RS();
      tickstart = HAL_GetTick();

      while (LL_RTC_IsActiveFlag_RS() == 0U)
      {
        if ((HAL_GetTick() - tickstart) > RTC_TIMEOUT_VALUE)
        {
          if (LL_RTC_IsActiveFlag_RS() == 0U)
          {
            return HAL_ERROR;
          }
        }
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Wait until there is no more shift operation ongoing.
  * @retval HAL_OK
  * @retval HAL_ERROR If a shift operation is still ongoing after RTC timeout duration.
  */
static hal_status_t RTC_WaitSynchro_SHP(void)
{
  uint32_t tickstart = HAL_GetTick();

  while (LL_RTC_IsActiveFlag_SHP() == 1U)
  {
    if ((HAL_GetTick() - tickstart) > RTC_TIMEOUT_VALUE)
    {
      if (LL_RTC_IsActiveFlag_SHP() == 1U)
      {
        return HAL_ERROR;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Wait until there is no more recalibration operation ongoing.
  * @retval HAL_OK
  * @retval HAL_ERROR If a recalibration operation is still ongoing after RTC timeout duration.
  */
static hal_status_t RTC_WaitSynchro_RECALP(void)
{
  uint32_t tickstart = HAL_GetTick();

  while (LL_RTC_IsActiveFlag_RECALP() == 1U)
  {
    if ((HAL_GetTick() - tickstart) > RTC_TIMEOUT_VALUE)
    {
      if (LL_RTC_IsActiveFlag_RECALP() == 1U)
      {
        return HAL_ERROR;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Wait until the WUTWF bit of ICSR register is set
  *         after the wake-up timer has been disabled.
  * @retval HAL_OK
  * @retval HAL_ERROR If WUTWF is still unset after RTC timeout duration.
  */
static hal_status_t RTC_WaitSynchro_WUTW(void)
{
  uint32_t tickstart;

  if (LL_RTC_IsActiveFlag_INIT() == 0U)
  {
    if (LL_RTC_WAKEUP_IsEnabled() == 1U)
    {
      return HAL_ERROR;
    }
    tickstart = HAL_GetTick();

    while (LL_RTC_IsActiveFlag_WUTW() == 0U)
    {
      if ((HAL_GetTick() - tickstart) > RTC_TIMEOUT_VALUE)
      {
        if (LL_RTC_IsActiveFlag_WUTW() == 0U)
        {
          return HAL_ERROR;
        }
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Retrieve the RTC current time.
  * @param  p_time Pointer to time instance.
  * @retval HAL_OK
  * @retval HAL_ERROR When a timeout occurs on the shadow register flag.
  */
__STATIC_INLINE hal_status_t RTC_GetTime(hal_rtc_time_t *p_time)
{
  hal_status_t status;
  status = RTC_WaitSynchro_RS();

  if (status != HAL_OK)
  {
    return status;
  }

  uint32_t temp_time_format = LL_RTC_TIME_GetTimeAndFormat();
  uint32_t format_am_pm = (((uint32_t) HAL_RTC_TIME_FORMAT_PM) * LL_RTC_GET_FORMAT(temp_time_format));

  p_time->am_pm = (hal_rtc_time_format_am_pm_t) format_am_pm;

  p_time->hour = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_HOUR(temp_time_format));
  p_time->min = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_MINUTE(temp_time_format));
  p_time->sec =  HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_SECOND(temp_time_format));

  p_time->subsec = LL_RTC_TIME_GetSubSecond();

  return status;
}

/**
  * @brief  Retrieve the RTC current date.
  * @param  p_date Pointer to date instance.
  * @retval HAL_OK
  * @retval HAL_ERROR When a timeout occurs on the shadow register flag.
  */
__STATIC_INLINE hal_status_t RTC_GetDate(hal_rtc_date_t *p_date)
{
  uint32_t temp_value_date = LL_RTC_DATE_Get();
  uint32_t week_day = LL_RTC_GET_WEEKDAY(temp_value_date);
  uint32_t month = LL_RTC_GET_MONTH(temp_value_date);

  /* No need to use HAL_RTC_CONVERT_BCD2DEC for wday because the max value is less than 10; BCD equals decimal */
  p_date->wday = (hal_rtc_weekday_t) week_day;
  p_date->mday = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_DAY(temp_value_date));
  p_date->mon = (hal_rtc_month_t) month;
  p_date->year = HAL_RTC_CONVERT_BCD2DEC(LL_RTC_GET_YEAR(temp_value_date));

  return RTC_WaitSynchro_RS();
}

/**
  * @brief  Retrieve the value of the wake-up timer decrement frequency.
  * @param  clock_prescaler_wakeup Wake-up clock prescaler.
  * @retval Wake-up timer decrement frequency.
  */
__STATIC_INLINE uint32_t RTC_GetWakeUpClockFrequency(hal_rtc_wakeup_timer_clock_t clock_prescaler_wakeup)
{
  uint32_t frequency_wakeup;
  uint32_t prescaler_value;
  uint32_t frequency_rtcclk;

  /* RCC gives the value of the RTCCLK used; it can be HSE (with prescaler), LSE, or LSI (with prescaler) */
  frequency_rtcclk = RTC_GetRTCClockCalibrated();

  if (clock_prescaler_wakeup >= HAL_RTC_WAKEUP_TIMER_CLOCK_BCD_UPDATE)
  {
    frequency_wakeup = RTC_GetRTCClockAfterPrescalerS(frequency_rtcclk);
  }
  else
  {
    /* Values of the wake-up prescaler are 2, 4, 8, and 16 and are directly on RTCCLK */
    prescaler_value = 16UL >> ((uint32_t) clock_prescaler_wakeup);
    frequency_wakeup = frequency_rtcclk / prescaler_value;
  }

  return frequency_wakeup;
}

/**
  * @brief  Retrieve the RTCCLK frequency after calibration.
  * @return Value of the RTCCLK frequency after calibration.
  */
__STATIC_INLINE uint32_t RTC_GetRTCClockCalibrated(void)
{
  /* Check if low power mode is needed */
  uint32_t frequency_rtcclk;
  uint32_t calib_m;
  uint32_t calib_p;

  frequency_rtcclk = HAL_RCC_RTC_GetKernelClkFreq();

  calib_m = LL_RTC_CAL_GetMinus();
  calib_p = LL_RTC_CAL_IsPulseInserted();

  /*Corrected frequency depending on the calibration */
  frequency_rtcclk = frequency_rtcclk * (1U + (((calib_p * RTC_TIMEOUT_VALUE) - calib_m) /
                                               ((0x1UL << 20U) + calib_m - (calib_p * RTC_TIMEOUT_VALUE))));

  return frequency_rtcclk;
}

/**
  * @brief  Retrieve the RTCCLK frequency after the synchronous prescaler (second one of RTC).
  * @param  frequency input frequency of the RTCCLK
  * @return Value of the frequency after the synchronous prescaler
  */
__STATIC_INLINE uint32_t RTC_GetRTCClockAfterPrescalerS(uint32_t frequency)
{
  return frequency / ((1U + LL_RTC_GetAsynchPrescaler()) * (1U + LL_RTC_GetSynchPrescaler()));
}

/**
  * @brief  Convert seconds and microseconds into bits representing time depending on a frequency.
  * @param  seconds number of seconds.
  * @param  milliseconds number of milliseconds.
  * @param  microseconds number of microseconds.
  * @param  frequency frequency used to convert.
  * @retval Bits representing time depending on a frequency.
  */
__STATIC_INLINE uint32_t RTC_ConvertSecSubsecToBits(uint32_t seconds, uint32_t milliseconds,
                                                    uint32_t microseconds, uint32_t frequency)
{
  const uint32_t freq_per_millisecond = frequency / RTC_MILLISECONDS;
  const uint32_t freq_per_microsecond = frequency / RTC_MICROSECONDS;

  return (uint32_t)((seconds * frequency) + (milliseconds * freq_per_millisecond) +
                    (microseconds * freq_per_microsecond));

}

/**
  * @brief Convert time bits values to time values (hours, minutes, seconds and microseconds).
  * @param p_time pointer to a time instance.
  * @param bits value of the time in bits.
  * @param frequency frequency used to convert.
  */
__STATIC_INLINE void RTC_ConvertBitsToTime(hal_rtc_time_t *p_time, uint32_t bits, uint32_t frequency)
{
  const uint32_t microseconds_per_bit = RTC_MICROSECONDS / frequency;

  uint32_t total_seconds = bits / frequency;
  uint32_t remaining_bits = bits % frequency;
  uint32_t total_microseconds = remaining_bits * microseconds_per_bit;

  p_time->millisec = total_microseconds / RTC_MILLISECONDS;
  p_time->microsec = total_microseconds % RTC_MILLISECONDS;
  p_time->hour = total_seconds / RTC_HOUR_SECONDS;
  total_seconds %= RTC_HOUR_SECONDS;

  p_time->min = total_seconds / RTC_MIN_SECONDS;
  p_time->sec = total_seconds % RTC_MIN_SECONDS;
}

/**
  * @}
  */

#endif /* USE_HAL_RTC_MODULE */

/**
  * @}
  */

/**
  * @}
  */
